/* automatically generated by rust-bindgen 0.54.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage, Align> {
    storage: Storage,
    align: [Align; 0],
}
impl<Storage, Align> __BindgenBitfieldUnit<Storage, Align> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage, align: [] }
    }
}
impl<Storage, Align> __BindgenBitfieldUnit<Storage, Align>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]

pub const USMUSER_FLAG_KEEP_MASTER_KEY: u32 = 1;
pub const USM_CREATE_USER_AUTH_DFLT: i32 = -1;
pub const USM_CREATE_USER_AUTH_MD5: u32 = 2;
pub const USM_CREATE_USER_AUTH_SHA1: u32 = 3;
pub const USM_CREATE_USER_AUTH_SHA: u32 = 3;
pub const USM_CREATE_USER_AUTH_SHA512: u32 = 7;
pub const USM_CREATE_USER_AUTH_SHA384: u32 = 6;
pub const USM_CREATE_USER_AUTH_SHA256: u32 = 5;
pub const USM_CREATE_USER_AUTH_SHA224: u32 = 4;
pub const USM_DES_FLAG_3: u32 = 256;
pub const USM_AES_FLAG_192: u32 = 256;
pub const USM_AES_FLAG_256: u32 = 512;
pub const USM_AES_REEDER_FLAG: u32 = 196608;
pub const USM_AES_FLAG_CISCO: u32 = 1048576;
pub const USM_PRIV_MASK_ALG: u32 = 255;
pub const USM_PRIV_MASK_VARIANT: u32 = 65280;
pub const USM_CREATE_USER_PRIV_DFLT: i32 = -1;
pub const USM_CREATE_USER_PRIV_NONE: u32 = 0;
pub const USM_CREATE_USER_PRIV_DES: u32 = 1;
pub const USM_CREATE_USER_PRIV_3DES: u32 = 257;
pub const USM_CREATE_USER_PRIV_AES: u32 = 2;
pub const USM_CREATE_USER_PRIV_AES192: u32 = 258;
pub const USM_CREATE_USER_PRIV_AES256: u32 = 514;
pub const USM_CREATE_USER_PRIV_AES192_CISCO: u32 = 1245442;
pub const USM_CREATE_USER_PRIV_AES256_CISCO: u32 = 1245698;
pub type size_t = usize;
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__fsid_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: ::std::os::raw::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: ::std::os::raw::c_uint,
    pub __wchb: [::std::os::raw::c_char; 4usize],
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout___mbstate_t__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__mbstate_t__bindgen_ty_1>())).__wch as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wch)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__mbstate_t__bindgen_ty_1>())).__wchb as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wchb)
        )
    );
}
impl Default for __mbstate_t__bindgen_ty_1 {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t>(),
        8usize,
        concat!("Size of: ", stringify!(__mbstate_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__mbstate_t>())).__count as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__mbstate_t>())).__value as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__value)
        )
    );
}
impl Default for __mbstate_t {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos_t() {
    assert_eq!(
        ::std::mem::size_of::<_G_fpos_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_G_fpos_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_G_fpos_t>())).__pos as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_G_fpos_t>())).__state as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__state)
        )
    );
}
impl Default for _G_fpos_t {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type __fpos_t = _G_fpos_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos64_t() {
    assert_eq!(
        ::std::mem::size_of::<_G_fpos64_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_G_fpos64_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_G_fpos64_t>())).__pos as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_G_fpos64_t>())).__state as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__state)
        )
    );
}
impl Default for _G_fpos64_t {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type __fpos64_t = _G_fpos64_t;
pub type __FILE = _IO_FILE;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_codecvt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_wide_data {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub _codecvt: *mut _IO_codecvt,
    pub _wide_data: *mut _IO_wide_data,
    pub _freeres_list: *mut _IO_FILE,
    pub _freeres_buf: *mut ::std::os::raw::c_void,
    pub __pad5: size_t,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[test]
fn bindgen_test_layout__IO_FILE() {
    assert_eq!(
        ::std::mem::size_of::<_IO_FILE>(),
        216usize,
        concat!("Size of: ", stringify!(_IO_FILE))
    );
    assert_eq!(
        ::std::mem::align_of::<_IO_FILE>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_FILE))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_ptr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_end as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_base as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_base as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_ptr as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_end as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_buf_base as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_buf_end as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_save_base as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_backup_base as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_backup_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_save_end as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._markers as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_markers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._chain as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_chain)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._fileno as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_fileno)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._flags2 as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._old_offset as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_old_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._cur_column as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_cur_column)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._vtable_offset as *const _ as usize },
        130usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_vtable_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._shortbuf as *const _ as usize },
        131usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_shortbuf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._lock as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_lock)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._offset as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._codecvt as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_codecvt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._wide_data as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_wide_data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._freeres_list as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_list)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._freeres_buf as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_buf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>())).__pad5 as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad5)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._mode as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._unused2 as *const _ as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_unused2)
        )
    );
}
impl Default for _IO_FILE {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type cookie_read_function_t = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __buf: *mut ::std::os::raw::c_char,
        __nbytes: size_t,
    ) -> __ssize_t,
>;
pub type cookie_write_function_t = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __buf: *const ::std::os::raw::c_char,
        __nbytes: size_t,
    ) -> __ssize_t,
>;
pub type cookie_seek_function_t = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __pos: *mut __off64_t,
        __w: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type cookie_close_function_t = ::std::option::Option<
    unsafe extern "C" fn(__cookie: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _IO_cookie_io_functions_t {
    pub read: cookie_read_function_t,
    pub write: cookie_write_function_t,
    pub seek: cookie_seek_function_t,
    pub close: cookie_close_function_t,
}
#[test]
fn bindgen_test_layout__IO_cookie_io_functions_t() {
    assert_eq!(
        ::std::mem::size_of::<_IO_cookie_io_functions_t>(),
        32usize,
        concat!("Size of: ", stringify!(_IO_cookie_io_functions_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_IO_cookie_io_functions_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_cookie_io_functions_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_cookie_io_functions_t>())).read as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_cookie_io_functions_t),
            "::",
            stringify!(read)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_cookie_io_functions_t>())).write as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_cookie_io_functions_t),
            "::",
            stringify!(write)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_cookie_io_functions_t>())).seek as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_cookie_io_functions_t),
            "::",
            stringify!(seek)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_IO_cookie_io_functions_t>())).close as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_cookie_io_functions_t),
            "::",
            stringify!(close)
        )
    );
}
pub type cookie_io_functions_t = _IO_cookie_io_functions_t;
pub type off_t = __off_t;
pub type off64_t = __off64_t;
pub type ssize_t = __ssize_t;
pub type fpos_t = __fpos_t;
pub type fpos64_t = __fpos64_t;
extern "C" {
    pub static mut stdin: *mut FILE;
}
extern "C" {
    pub static mut stdout: *mut FILE;
}
extern "C" {
    pub static mut stderr: *mut FILE;
}
extern "C" {
    pub fn remove(__filename: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rename(
        __old: *const ::std::os::raw::c_char,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn renameat(
        __oldfd: ::std::os::raw::c_int,
        __old: *const ::std::os::raw::c_char,
        __newfd: ::std::os::raw::c_int,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn renameat2(
        __oldfd: ::std::os::raw::c_int,
        __old: *const ::std::os::raw::c_char,
        __newfd: ::std::os::raw::c_int,
        __new: *const ::std::os::raw::c_char,
        __flags: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpfile64() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tmpnam_r(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tempnam(
        __dir: *const ::std::os::raw::c_char,
        __pfx: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fcloseall() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn freopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
        __stream: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fopen64(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn freopen64(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
        __stream: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fdopen(__fd: ::std::os::raw::c_int, __modes: *const ::std::os::raw::c_char)
        -> *mut FILE;
}
extern "C" {
    pub fn fopencookie(
        __magic_cookie: *mut ::std::os::raw::c_void,
        __modes: *const ::std::os::raw::c_char,
        __io_funcs: cookie_io_functions_t,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fmemopen(
        __s: *mut ::std::os::raw::c_void,
        __len: size_t,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn open_memstream(
        __bufloc: *mut *mut ::std::os::raw::c_char,
        __sizeloc: *mut size_t,
    ) -> *mut FILE;
}
extern "C" {
    pub fn setbuf(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn setvbuf(
        __stream: *mut FILE,
        __buf: *mut ::std::os::raw::c_char,
        __modes: ::std::os::raw::c_int,
        __n: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setbuffer(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char, __size: size_t);
}
extern "C" {
    pub fn setlinebuf(__stream: *mut FILE);
}
extern "C" {
    pub fn fprintf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn printf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfprintf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vprintf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsnprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vasprintf(
        __ptr: *mut *mut ::std::os::raw::c_char,
        __f: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __asprintf(
        __ptr: *mut *mut ::std::os::raw::c_char,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn asprintf(
        __ptr: *mut *mut ::std::os::raw::c_char,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vdprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fscanf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn scanf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_fscanf"]
    pub fn fscanf1(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_scanf"]
    pub fn scanf1(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_sscanf"]
    pub fn sscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfscanf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vscanf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vfscanf"]
    pub fn vfscanf1(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vscanf"]
    pub fn vscanf1(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vsscanf"]
    pub fn vsscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar_unlocked(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getw(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putw(__w: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgets(
        __s: *mut ::std::os::raw::c_char,
        __n: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fgets_unlocked(
        __s: *mut ::std::os::raw::c_char,
        __n: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut size_t,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut size_t,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getline(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut size_t,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn fputs(__s: *const ::std::os::raw::c_char, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn puts(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ungetc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fread(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn fwrite(
        __ptr: *const ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __s: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn fputs_unlocked(
        __s: *const ::std::os::raw::c_char,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fread_unlocked(
        __ptr: *mut ::std::os::raw::c_void,
        __size: size_t,
        __n: size_t,
        __stream: *mut FILE,
    ) -> size_t;
}
extern "C" {
    pub fn fwrite_unlocked(
        __ptr: *const ::std::os::raw::c_void,
        __size: size_t,
        __n: size_t,
        __stream: *mut FILE,
    ) -> size_t;
}
extern "C" {
    pub fn fseek(
        __stream: *mut FILE,
        __off: ::std::os::raw::c_long,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftell(__stream: *mut FILE) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn rewind(__stream: *mut FILE);
}
extern "C" {
    pub fn fseeko(
        __stream: *mut FILE,
        __off: __off_t,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftello(__stream: *mut FILE) -> __off_t;
}
extern "C" {
    pub fn fgetpos(__stream: *mut FILE, __pos: *mut fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fsetpos(__stream: *mut FILE, __pos: *const fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fseeko64(
        __stream: *mut FILE,
        __off: __off64_t,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftello64(__stream: *mut FILE) -> __off64_t;
}
extern "C" {
    pub fn fgetpos64(__stream: *mut FILE, __pos: *mut fpos64_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fsetpos64(__stream: *mut FILE, __pos: *const fpos64_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr(__stream: *mut FILE);
}
extern "C" {
    pub fn feof(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr_unlocked(__stream: *mut FILE);
}
extern "C" {
    pub fn feof_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn perror(__s: *const ::std::os::raw::c_char);
}
extern "C" {
    pub static mut sys_nerr: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut sys_errlist: [*const ::std::os::raw::c_char; 0usize];
}
extern "C" {
    pub static mut _sys_nerr: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut _sys_errlist: [*const ::std::os::raw::c_char; 0usize];
}
extern "C" {
    pub fn fileno(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fileno_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn popen(
        __command: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn pclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ctermid(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn cuserid(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct obstack {
    _unused: [u8; 0],
}
extern "C" {
    pub fn obstack_printf(
        __obstack: *mut obstack,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn obstack_vprintf(
        __obstack: *mut obstack,
        __format: *const ::std::os::raw::c_char,
        __args: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn flockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn ftrylockfile(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn funlockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn __uflow(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __overflow(arg1: *mut FILE, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
pub type time_t = __time_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    assert_eq!(
        ::std::mem::size_of::<timeval>(),
        16usize,
        concat!("Size of: ", stringify!(timeval))
    );
    assert_eq!(
        ::std::mem::align_of::<timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(timeval))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timeval>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timeval>())).tv_usec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_usec)
        )
    );
}
pub type suseconds_t = __suseconds_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___sigset_t() {
    assert_eq!(
        ::std::mem::size_of::<__sigset_t>(),
        128usize,
        concat!("Size of: ", stringify!(__sigset_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__sigset_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__sigset_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sigset_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sigset_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    assert_eq!(
        ::std::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::std::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timespec>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timespec>())).tv_nsec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fd_set {
    pub fds_bits: [__fd_mask; 16usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
    assert_eq!(
        ::std::mem::size_of::<fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(fd_set))
    );
    assert_eq!(
        ::std::mem::align_of::<fd_set>(),
        8usize,
        concat!("Alignment of ", stringify!(fd_set))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fd_set>())).fds_bits as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fd_set),
            "::",
            stringify!(fds_bits)
        )
    );
}
pub type fd_mask = __fd_mask;
extern "C" {
    pub fn select(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pselect(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct timezone {
    pub tz_minuteswest: ::std::os::raw::c_int,
    pub tz_dsttime: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_timezone() {
    assert_eq!(
        ::std::mem::size_of::<timezone>(),
        8usize,
        concat!("Size of: ", stringify!(timezone))
    );
    assert_eq!(
        ::std::mem::align_of::<timezone>(),
        4usize,
        concat!("Alignment of ", stringify!(timezone))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timezone>())).tz_minuteswest as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timezone),
            "::",
            stringify!(tz_minuteswest)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timezone>())).tz_dsttime as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(timezone),
            "::",
            stringify!(tz_dsttime)
        )
    );
}
extern "C" {
    pub fn gettimeofday(
        __tv: *mut timeval,
        __tz: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn settimeofday(__tv: *const timeval, __tz: *const timezone) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn adjtime(__delta: *const timeval, __olddelta: *mut timeval) -> ::std::os::raw::c_int;
}
pub const __itimer_which_ITIMER_REAL: __itimer_which = 0;
pub const __itimer_which_ITIMER_VIRTUAL: __itimer_which = 1;
pub const __itimer_which_ITIMER_PROF: __itimer_which = 2;
pub type __itimer_which = u32;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct itimerval {
    pub it_interval: timeval,
    pub it_value: timeval,
}
#[test]
fn bindgen_test_layout_itimerval() {
    assert_eq!(
        ::std::mem::size_of::<itimerval>(),
        32usize,
        concat!("Size of: ", stringify!(itimerval))
    );
    assert_eq!(
        ::std::mem::align_of::<itimerval>(),
        8usize,
        concat!("Alignment of ", stringify!(itimerval))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<itimerval>())).it_interval as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(itimerval),
            "::",
            stringify!(it_interval)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<itimerval>())).it_value as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(itimerval),
            "::",
            stringify!(it_value)
        )
    );
}
pub use self::__itimer_which as __itimer_which_t;
extern "C" {
    pub fn getitimer(__which: __itimer_which_t, __value: *mut itimerval) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setitimer(
        __which: __itimer_which_t,
        __new: *const itimerval,
        __old: *mut itimerval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn utimes(
        __file: *const ::std::os::raw::c_char,
        __tvp: *const timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lutimes(
        __file: *const ::std::os::raw::c_char,
        __tvp: *const timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn futimes(__fd: ::std::os::raw::c_int, __tvp: *const timeval) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn futimesat(
        __fd: ::std::os::raw::c_int,
        __file: *const ::std::os::raw::c_char,
        __tvp: *const timeval,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct timex {
    pub modes: ::std::os::raw::c_uint,
    pub offset: __syscall_slong_t,
    pub freq: __syscall_slong_t,
    pub maxerror: __syscall_slong_t,
    pub esterror: __syscall_slong_t,
    pub status: ::std::os::raw::c_int,
    pub constant: __syscall_slong_t,
    pub precision: __syscall_slong_t,
    pub tolerance: __syscall_slong_t,
    pub time: timeval,
    pub tick: __syscall_slong_t,
    pub ppsfreq: __syscall_slong_t,
    pub jitter: __syscall_slong_t,
    pub shift: ::std::os::raw::c_int,
    pub stabil: __syscall_slong_t,
    pub jitcnt: __syscall_slong_t,
    pub calcnt: __syscall_slong_t,
    pub errcnt: __syscall_slong_t,
    pub stbcnt: __syscall_slong_t,
    pub tai: ::std::os::raw::c_int,
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 44usize], u8>,
}
#[test]
fn bindgen_test_layout_timex() {
    assert_eq!(
        ::std::mem::size_of::<timex>(),
        208usize,
        concat!("Size of: ", stringify!(timex))
    );
    assert_eq!(
        ::std::mem::align_of::<timex>(),
        8usize,
        concat!("Alignment of ", stringify!(timex))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timex>())).modes as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timex),
            "::",
            stringify!(modes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timex>())).offset as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timex),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timex>())).freq as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(timex),
            "::",
            stringify!(freq)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timex>())).maxerror as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(timex),
            "::",
            stringify!(maxerror)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timex>())).esterror as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(timex),
            "::",
            stringify!(esterror)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timex>())).status as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(timex),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timex>())).constant as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(timex),
            "::",
            stringify!(constant)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timex>())).precision as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(timex),
            "::",
            stringify!(precision)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timex>())).tolerance as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(timex),
            "::",
            stringify!(tolerance)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timex>())).time as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(timex),
            "::",
            stringify!(time)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timex>())).tick as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(timex),
            "::",
            stringify!(tick)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timex>())).ppsfreq as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(timex),
            "::",
            stringify!(ppsfreq)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timex>())).jitter as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(timex),
            "::",
            stringify!(jitter)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timex>())).shift as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(timex),
            "::",
            stringify!(shift)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timex>())).stabil as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(timex),
            "::",
            stringify!(stabil)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timex>())).jitcnt as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(timex),
            "::",
            stringify!(jitcnt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timex>())).calcnt as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(timex),
            "::",
            stringify!(calcnt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timex>())).errcnt as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(timex),
            "::",
            stringify!(errcnt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timex>())).stbcnt as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(timex),
            "::",
            stringify!(stbcnt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timex>())).tai as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(timex),
            "::",
            stringify!(tai)
        )
    );
}
impl Default for timex {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
extern "C" {
    pub fn clock_adjtime(__clock_id: __clockid_t, __utx: *mut timex) -> ::std::os::raw::c_int;
}
pub type clock_t = __clock_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm {
    pub tm_sec: ::std::os::raw::c_int,
    pub tm_min: ::std::os::raw::c_int,
    pub tm_hour: ::std::os::raw::c_int,
    pub tm_mday: ::std::os::raw::c_int,
    pub tm_mon: ::std::os::raw::c_int,
    pub tm_year: ::std::os::raw::c_int,
    pub tm_wday: ::std::os::raw::c_int,
    pub tm_yday: ::std::os::raw::c_int,
    pub tm_isdst: ::std::os::raw::c_int,
    pub tm_gmtoff: ::std::os::raw::c_long,
    pub tm_zone: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_tm() {
    assert_eq!(
        ::std::mem::size_of::<tm>(),
        56usize,
        concat!("Size of: ", stringify!(tm))
    );
    assert_eq!(
        ::std::mem::align_of::<tm>(),
        8usize,
        concat!("Alignment of ", stringify!(tm))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_min as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_min)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_hour as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_hour)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_mday as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_mday)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_mon as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_mon)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_year as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_year)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_wday as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_wday)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_yday as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_yday)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_isdst as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_isdst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_gmtoff as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_gmtoff)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm>())).tm_zone as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_zone)
        )
    );
}
impl Default for tm {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type clockid_t = __clockid_t;
pub type timer_t = __timer_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct itimerspec {
    pub it_interval: timespec,
    pub it_value: timespec,
}
#[test]
fn bindgen_test_layout_itimerspec() {
    assert_eq!(
        ::std::mem::size_of::<itimerspec>(),
        32usize,
        concat!("Size of: ", stringify!(itimerspec))
    );
    assert_eq!(
        ::std::mem::align_of::<itimerspec>(),
        8usize,
        concat!("Alignment of ", stringify!(itimerspec))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<itimerspec>())).it_interval as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(itimerspec),
            "::",
            stringify!(it_interval)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<itimerspec>())).it_value as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(itimerspec),
            "::",
            stringify!(it_value)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sigevent {
    _unused: [u8; 0],
}
pub type pid_t = __pid_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::std::os::raw::c_ushort,
    pub __ctype_tolower: *const ::std::os::raw::c_int,
    pub __ctype_toupper: *const ::std::os::raw::c_int,
    pub __names: [*const ::std::os::raw::c_char; 13usize],
}
#[test]
fn bindgen_test_layout___locale_struct() {
    assert_eq!(
        ::std::mem::size_of::<__locale_struct>(),
        232usize,
        concat!("Size of: ", stringify!(__locale_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<__locale_struct>(),
        8usize,
        concat!("Alignment of ", stringify!(__locale_struct))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__locales as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__locales)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__ctype_b as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_b)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__ctype_tolower as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_tolower)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__ctype_toupper as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_toupper)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__names as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__names)
        )
    );
}
impl Default for __locale_struct {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
extern "C" {
    pub fn clock() -> clock_t;
}
extern "C" {
    pub fn time(__timer: *mut time_t) -> time_t;
}
extern "C" {
    pub fn difftime(__time1: time_t, __time0: time_t) -> f64;
}
extern "C" {
    pub fn mktime(__tp: *mut tm) -> time_t;
}
extern "C" {
    pub fn strftime(
        __s: *mut ::std::os::raw::c_char,
        __maxsize: size_t,
        __format: *const ::std::os::raw::c_char,
        __tp: *const tm,
    ) -> size_t;
}
extern "C" {
    pub fn strptime(
        __s: *const ::std::os::raw::c_char,
        __fmt: *const ::std::os::raw::c_char,
        __tp: *mut tm,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strftime_l(
        __s: *mut ::std::os::raw::c_char,
        __maxsize: size_t,
        __format: *const ::std::os::raw::c_char,
        __tp: *const tm,
        __loc: locale_t,
    ) -> size_t;
}
extern "C" {
    pub fn strptime_l(
        __s: *const ::std::os::raw::c_char,
        __fmt: *const ::std::os::raw::c_char,
        __tp: *mut tm,
        __loc: locale_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn gmtime(__timer: *const time_t) -> *mut tm;
}
extern "C" {
    pub fn localtime(__timer: *const time_t) -> *mut tm;
}
extern "C" {
    pub fn gmtime_r(__timer: *const time_t, __tp: *mut tm) -> *mut tm;
}
extern "C" {
    pub fn localtime_r(__timer: *const time_t, __tp: *mut tm) -> *mut tm;
}
extern "C" {
    pub fn asctime(__tp: *const tm) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ctime(__timer: *const time_t) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn asctime_r(
        __tp: *const tm,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ctime_r(
        __timer: *const time_t,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub static mut __tzname: [*mut ::std::os::raw::c_char; 2usize];
}
extern "C" {
    pub static mut __daylight: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut __timezone: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut tzname: [*mut ::std::os::raw::c_char; 2usize];
}
extern "C" {
    pub fn tzset();
}
extern "C" {
    pub static mut daylight: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut timezone: ::std::os::raw::c_long;
}
extern "C" {
    pub fn timegm(__tp: *mut tm) -> time_t;
}
extern "C" {
    pub fn timelocal(__tp: *mut tm) -> time_t;
}
extern "C" {
    pub fn dysize(__year: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn nanosleep(
        __requested_time: *const timespec,
        __remaining: *mut timespec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_getres(__clock_id: clockid_t, __res: *mut timespec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_gettime(__clock_id: clockid_t, __tp: *mut timespec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_settime(__clock_id: clockid_t, __tp: *const timespec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_nanosleep(
        __clock_id: clockid_t,
        __flags: ::std::os::raw::c_int,
        __req: *const timespec,
        __rem: *mut timespec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_getcpuclockid(__pid: pid_t, __clock_id: *mut clockid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_create(
        __clock_id: clockid_t,
        __evp: *mut sigevent,
        __timerid: *mut timer_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_delete(__timerid: timer_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_settime(
        __timerid: timer_t,
        __flags: ::std::os::raw::c_int,
        __value: *const itimerspec,
        __ovalue: *mut itimerspec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_gettime(__timerid: timer_t, __value: *mut itimerspec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_getoverrun(__timerid: timer_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timespec_get(
        __ts: *mut timespec,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub static mut getdate_err: ::std::os::raw::c_int;
}
extern "C" {
    pub fn getdate(__string: *const ::std::os::raw::c_char) -> *mut tm;
}
extern "C" {
    pub fn getdate_r(
        __string: *const ::std::os::raw::c_char,
        __resbufp: *mut tm,
    ) -> ::std::os::raw::c_int;
}
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type __gwchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct imaxdiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_imaxdiv_t() {
    assert_eq!(
        ::std::mem::size_of::<imaxdiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(imaxdiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<imaxdiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(imaxdiv_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<imaxdiv_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(imaxdiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<imaxdiv_t>())).rem as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(imaxdiv_t),
            "::",
            stringify!(rem)
        )
    );
}
extern "C" {
    pub fn imaxabs(__n: intmax_t) -> intmax_t;
}
extern "C" {
    pub fn imaxdiv(__numer: intmax_t, __denom: intmax_t) -> imaxdiv_t;
}
extern "C" {
    pub fn strtoimax(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn strtoumax(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
extern "C" {
    pub fn wcstoimax(
        __nptr: *const __gwchar_t,
        __endptr: *mut *mut __gwchar_t,
        __base: ::std::os::raw::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn wcstoumax(
        __nptr: *const __gwchar_t,
        __endptr: *mut *mut __gwchar_t,
        __base: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type ino64_t = __ino64_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type useconds_t = __useconds_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = ::std::os::raw::c_long;
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
pub type blkcnt64_t = __blkcnt64_t;
pub type fsblkcnt64_t = __fsblkcnt64_t;
pub type fsfilcnt64_t = __fsfilcnt64_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[test]
fn bindgen_test_layout___pthread_internal_list() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_list>(),
        16usize,
        concat!("Size of: ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_list>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_internal_list>())).__prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_internal_list>())).__next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__next)
        )
    );
}
impl Default for __pthread_internal_list {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[test]
fn bindgen_test_layout___pthread_internal_slist() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_internal_slist>())).__next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_slist),
            "::",
            stringify!(__next)
        )
    );
}
impl Default for __pthread_internal_slist {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[test]
fn bindgen_test_layout___pthread_mutex_s() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_mutex_s>(),
        40usize,
        concat!("Size of: ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_mutex_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__lock as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__lock)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__count as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__owner as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__owner)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__nusers as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__nusers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__kind as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__spins as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__spins)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__elision as *const _ as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__elision)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__list as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__list)
        )
    );
}
impl Default for __pthread_mutex_s {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __cur_writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __rwelision: ::std::os::raw::c_schar,
    pub __pad1: [::std::os::raw::c_uchar; 7usize],
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_rwlock_arch_t() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_rwlock_arch_t>(),
        56usize,
        concat!("Size of: ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_rwlock_arch_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__readers as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__readers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__writers as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__wrphase_futex as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__wrphase_futex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__writers_futex as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers_futex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad3 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad3)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad4 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad4)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__cur_writer as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__cur_writer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__shared as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__shared)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__rwelision as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__rwelision)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad1 as *const _ as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad2 as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__flags as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__flags)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __bindgen_anon_1: __pthread_cond_s__bindgen_ty_1,
    pub __bindgen_anon_2: __pthread_cond_s__bindgen_ty_2,
    pub __g_refs: [::std::os::raw::c_uint; 2usize],
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __pthread_cond_s__bindgen_ty_1 {
    pub __wseq: ::std::os::raw::c_ulonglong,
    pub __wseq32: __pthread_cond_s__bindgen_ty_1__bindgen_ty_1,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>())).__low
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>())).__high
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_cond_s__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1>())).__wseq as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1),
            "::",
            stringify!(__wseq)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1>())).__wseq32 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1),
            "::",
            stringify!(__wseq32)
        )
    );
}
impl Default for __pthread_cond_s__bindgen_ty_1 {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __pthread_cond_s__bindgen_ty_2 {
    pub __g1_start: ::std::os::raw::c_ulonglong,
    pub __g1_start32: __pthread_cond_s__bindgen_ty_2__bindgen_ty_1,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>())).__low
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>())).__high
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_cond_s__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s__bindgen_ty_2))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2>())).__g1_start as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2),
            "::",
            stringify!(__g1_start)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2>())).__g1_start32 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2),
            "::",
            stringify!(__g1_start32)
        )
    );
}
impl Default for __pthread_cond_s__bindgen_ty_2 {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[test]
fn bindgen_test_layout___pthread_cond_s() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s>(),
        48usize,
        concat!("Size of: ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_refs as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_refs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_size as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g1_orig_size as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g1_orig_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__wrefs as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__wrefs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_signals as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_signals)
        )
    );
}
impl Default for __pthread_cond_s {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutexattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutexattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__align)
        )
    );
}
impl Default for pthread_mutexattr_t {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_condattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_condattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_condattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_condattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_condattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__align)
        )
    );
}
impl Default for pthread_condattr_t {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 7usize],
}
#[test]
fn bindgen_test_layout_pthread_attr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_attr_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_attr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_attr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_attr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__align)
        )
    );
}
impl Default for pthread_attr_t {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 5usize],
}
#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_mutex_t>(),
        40usize,
        concat!("Size of: ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__align)
        )
    );
}
impl Default for pthread_mutex_t {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
    _bindgen_union_align: [u64; 6usize],
}
#[test]
fn bindgen_test_layout_pthread_cond_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__align)
        )
    );
}
impl Default for pthread_cond_t {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 7usize],
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlock_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlock_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__align)
        )
    );
}
impl Default for pthread_rwlock_t {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_pthread_rwlockattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlockattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlockattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__align)
        )
    );
}
impl Default for pthread_rwlockattr_t {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 4usize],
}
#[test]
fn bindgen_test_layout_pthread_barrier_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_barrier_t>(),
        32usize,
        concat!("Size of: ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrier_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrier_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrier_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__align)
        )
    );
}
impl Default for pthread_barrier_t {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_barrierattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrierattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrierattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__align)
        )
    );
}
impl Default for pthread_barrierattr_t {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type netsnmp_pid_t = pid_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iovec {
    pub iov_base: *mut ::std::os::raw::c_void,
    pub iov_len: size_t,
}
#[test]
fn bindgen_test_layout_iovec() {
    assert_eq!(
        ::std::mem::size_of::<iovec>(),
        16usize,
        concat!("Size of: ", stringify!(iovec))
    );
    assert_eq!(
        ::std::mem::align_of::<iovec>(),
        8usize,
        concat!("Alignment of ", stringify!(iovec))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<iovec>())).iov_base as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iovec),
            "::",
            stringify!(iov_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<iovec>())).iov_len as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iovec),
            "::",
            stringify!(iov_len)
        )
    );
}
impl Default for iovec {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type socklen_t = __socklen_t;
pub const __socket_type_SOCK_STREAM: __socket_type = 1;
pub const __socket_type_SOCK_DGRAM: __socket_type = 2;
pub const __socket_type_SOCK_RAW: __socket_type = 3;
pub const __socket_type_SOCK_RDM: __socket_type = 4;
pub const __socket_type_SOCK_SEQPACKET: __socket_type = 5;
pub const __socket_type_SOCK_DCCP: __socket_type = 6;
pub const __socket_type_SOCK_PACKET: __socket_type = 10;
pub const __socket_type_SOCK_CLOEXEC: __socket_type = 524288;
pub const __socket_type_SOCK_NONBLOCK: __socket_type = 2048;
pub type __socket_type = u32;
pub type sa_family_t = ::std::os::raw::c_ushort;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct sockaddr {
    pub sa_family: sa_family_t,
    pub sa_data: [::std::os::raw::c_char; 14usize],
}
#[test]
fn bindgen_test_layout_sockaddr() {
    assert_eq!(
        ::std::mem::size_of::<sockaddr>(),
        16usize,
        concat!("Size of: ", stringify!(sockaddr))
    );
    assert_eq!(
        ::std::mem::align_of::<sockaddr>(),
        2usize,
        concat!("Alignment of ", stringify!(sockaddr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr>())).sa_family as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr),
            "::",
            stringify!(sa_family)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr>())).sa_data as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr),
            "::",
            stringify!(sa_data)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sockaddr_storage {
    pub ss_family: sa_family_t,
    pub __ss_padding: [::std::os::raw::c_char; 118usize],
    pub __ss_align: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout_sockaddr_storage() {
    assert_eq!(
        ::std::mem::size_of::<sockaddr_storage>(),
        128usize,
        concat!("Size of: ", stringify!(sockaddr_storage))
    );
    assert_eq!(
        ::std::mem::align_of::<sockaddr_storage>(),
        8usize,
        concat!("Alignment of ", stringify!(sockaddr_storage))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr_storage>())).ss_family as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_storage),
            "::",
            stringify!(ss_family)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr_storage>())).__ss_padding as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_storage),
            "::",
            stringify!(__ss_padding)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr_storage>())).__ss_align as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_storage),
            "::",
            stringify!(__ss_align)
        )
    );
}
impl Default for sockaddr_storage {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub const MSG_OOB: _bindgen_ty_1 = 1;
pub const MSG_PEEK: _bindgen_ty_1 = 2;
pub const MSG_DONTROUTE: _bindgen_ty_1 = 4;
pub const MSG_TRYHARD: _bindgen_ty_1 = 4;
pub const MSG_CTRUNC: _bindgen_ty_1 = 8;
pub const MSG_PROXY: _bindgen_ty_1 = 16;
pub const MSG_TRUNC: _bindgen_ty_1 = 32;
pub const MSG_DONTWAIT: _bindgen_ty_1 = 64;
pub const MSG_EOR: _bindgen_ty_1 = 128;
pub const MSG_WAITALL: _bindgen_ty_1 = 256;
pub const MSG_FIN: _bindgen_ty_1 = 512;
pub const MSG_SYN: _bindgen_ty_1 = 1024;
pub const MSG_CONFIRM: _bindgen_ty_1 = 2048;
pub const MSG_RST: _bindgen_ty_1 = 4096;
pub const MSG_ERRQUEUE: _bindgen_ty_1 = 8192;
pub const MSG_NOSIGNAL: _bindgen_ty_1 = 16384;
pub const MSG_MORE: _bindgen_ty_1 = 32768;
pub const MSG_WAITFORONE: _bindgen_ty_1 = 65536;
pub const MSG_BATCH: _bindgen_ty_1 = 262144;
pub const MSG_ZEROCOPY: _bindgen_ty_1 = 67108864;
pub const MSG_FASTOPEN: _bindgen_ty_1 = 536870912;
pub const MSG_CMSG_CLOEXEC: _bindgen_ty_1 = 1073741824;
pub type _bindgen_ty_1 = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct msghdr {
    pub msg_name: *mut ::std::os::raw::c_void,
    pub msg_namelen: socklen_t,
    pub msg_iov: *mut iovec,
    pub msg_iovlen: size_t,
    pub msg_control: *mut ::std::os::raw::c_void,
    pub msg_controllen: size_t,
    pub msg_flags: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_msghdr() {
    assert_eq!(
        ::std::mem::size_of::<msghdr>(),
        56usize,
        concat!("Size of: ", stringify!(msghdr))
    );
    assert_eq!(
        ::std::mem::align_of::<msghdr>(),
        8usize,
        concat!("Alignment of ", stringify!(msghdr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<msghdr>())).msg_name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<msghdr>())).msg_namelen as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_namelen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<msghdr>())).msg_iov as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_iov)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<msghdr>())).msg_iovlen as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_iovlen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<msghdr>())).msg_control as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_control)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<msghdr>())).msg_controllen as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_controllen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<msghdr>())).msg_flags as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_flags)
        )
    );
}
impl Default for msghdr {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Default)]
pub struct cmsghdr {
    pub cmsg_len: size_t,
    pub cmsg_level: ::std::os::raw::c_int,
    pub cmsg_type: ::std::os::raw::c_int,
    pub __cmsg_data: __IncompleteArrayField<::std::os::raw::c_uchar>,
}
#[test]
fn bindgen_test_layout_cmsghdr() {
    assert_eq!(
        ::std::mem::size_of::<cmsghdr>(),
        16usize,
        concat!("Size of: ", stringify!(cmsghdr))
    );
    assert_eq!(
        ::std::mem::align_of::<cmsghdr>(),
        8usize,
        concat!("Alignment of ", stringify!(cmsghdr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cmsghdr>())).cmsg_len as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cmsghdr),
            "::",
            stringify!(cmsg_len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cmsghdr>())).cmsg_level as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cmsghdr),
            "::",
            stringify!(cmsg_level)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cmsghdr>())).cmsg_type as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(cmsghdr),
            "::",
            stringify!(cmsg_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<cmsghdr>())).__cmsg_data as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(cmsghdr),
            "::",
            stringify!(__cmsg_data)
        )
    );
}
extern "C" {
    pub fn __cmsg_nxthdr(__mhdr: *mut msghdr, __cmsg: *mut cmsghdr) -> *mut cmsghdr;
}
pub const SCM_RIGHTS: _bindgen_ty_2 = 1;
pub const SCM_CREDENTIALS: _bindgen_ty_2 = 2;
pub type _bindgen_ty_2 = u32;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ucred {
    pub pid: pid_t,
    pub uid: uid_t,
    pub gid: gid_t,
}
#[test]
fn bindgen_test_layout_ucred() {
    assert_eq!(
        ::std::mem::size_of::<ucred>(),
        12usize,
        concat!("Size of: ", stringify!(ucred))
    );
    assert_eq!(
        ::std::mem::align_of::<ucred>(),
        4usize,
        concat!("Alignment of ", stringify!(ucred))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ucred>())).pid as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ucred),
            "::",
            stringify!(pid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ucred>())).uid as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ucred),
            "::",
            stringify!(uid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ucred>())).gid as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ucred),
            "::",
            stringify!(gid)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __kernel_fd_set {
    pub fds_bits: [::std::os::raw::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___kernel_fd_set() {
    assert_eq!(
        ::std::mem::size_of::<__kernel_fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(__kernel_fd_set))
    );
    assert_eq!(
        ::std::mem::align_of::<__kernel_fd_set>(),
        8usize,
        concat!("Alignment of ", stringify!(__kernel_fd_set))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__kernel_fd_set>())).fds_bits as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__kernel_fd_set),
            "::",
            stringify!(fds_bits)
        )
    );
}
pub type __kernel_sighandler_t =
    ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>;
pub type __kernel_key_t = ::std::os::raw::c_int;
pub type __kernel_mqd_t = ::std::os::raw::c_int;
pub type __kernel_old_uid_t = ::std::os::raw::c_ushort;
pub type __kernel_old_gid_t = ::std::os::raw::c_ushort;
pub type __kernel_old_dev_t = ::std::os::raw::c_ulong;
pub type __kernel_long_t = ::std::os::raw::c_long;
pub type __kernel_ulong_t = ::std::os::raw::c_ulong;
pub type __kernel_ino_t = __kernel_ulong_t;
pub type __kernel_mode_t = ::std::os::raw::c_uint;
pub type __kernel_pid_t = ::std::os::raw::c_int;
pub type __kernel_ipc_pid_t = ::std::os::raw::c_int;
pub type __kernel_uid_t = ::std::os::raw::c_uint;
pub type __kernel_gid_t = ::std::os::raw::c_uint;
pub type __kernel_suseconds_t = __kernel_long_t;
pub type __kernel_daddr_t = ::std::os::raw::c_int;
pub type __kernel_uid32_t = ::std::os::raw::c_uint;
pub type __kernel_gid32_t = ::std::os::raw::c_uint;
pub type __kernel_size_t = __kernel_ulong_t;
pub type __kernel_ssize_t = __kernel_long_t;
pub type __kernel_ptrdiff_t = __kernel_long_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __kernel_fsid_t {
    pub val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___kernel_fsid_t() {
    assert_eq!(
        ::std::mem::size_of::<__kernel_fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__kernel_fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__kernel_fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__kernel_fsid_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__kernel_fsid_t>())).val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__kernel_fsid_t),
            "::",
            stringify!(val)
        )
    );
}
pub type __kernel_off_t = __kernel_long_t;
pub type __kernel_loff_t = ::std::os::raw::c_longlong;
pub type __kernel_time_t = __kernel_long_t;
pub type __kernel_time64_t = ::std::os::raw::c_longlong;
pub type __kernel_clock_t = __kernel_long_t;
pub type __kernel_timer_t = ::std::os::raw::c_int;
pub type __kernel_clockid_t = ::std::os::raw::c_int;
pub type __kernel_caddr_t = *mut ::std::os::raw::c_char;
pub type __kernel_uid16_t = ::std::os::raw::c_ushort;
pub type __kernel_gid16_t = ::std::os::raw::c_ushort;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct linger {
    pub l_onoff: ::std::os::raw::c_int,
    pub l_linger: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_linger() {
    assert_eq!(
        ::std::mem::size_of::<linger>(),
        8usize,
        concat!("Size of: ", stringify!(linger))
    );
    assert_eq!(
        ::std::mem::align_of::<linger>(),
        4usize,
        concat!("Alignment of ", stringify!(linger))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<linger>())).l_onoff as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linger),
            "::",
            stringify!(l_onoff)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<linger>())).l_linger as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(linger),
            "::",
            stringify!(l_linger)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct osockaddr {
    pub sa_family: ::std::os::raw::c_ushort,
    pub sa_data: [::std::os::raw::c_uchar; 14usize],
}
#[test]
fn bindgen_test_layout_osockaddr() {
    assert_eq!(
        ::std::mem::size_of::<osockaddr>(),
        16usize,
        concat!("Size of: ", stringify!(osockaddr))
    );
    assert_eq!(
        ::std::mem::align_of::<osockaddr>(),
        2usize,
        concat!("Alignment of ", stringify!(osockaddr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<osockaddr>())).sa_family as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(osockaddr),
            "::",
            stringify!(sa_family)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<osockaddr>())).sa_data as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(osockaddr),
            "::",
            stringify!(sa_data)
        )
    );
}
pub const SHUT_RD: _bindgen_ty_3 = 0;
pub const SHUT_WR: _bindgen_ty_3 = 1;
pub const SHUT_RDWR: _bindgen_ty_3 = 2;
pub type _bindgen_ty_3 = u32;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __SOCKADDR_ARG {
    pub __sockaddr__: *mut sockaddr,
    pub __sockaddr_at__: *mut sockaddr_at,
    pub __sockaddr_ax25__: *mut sockaddr_ax25,
    pub __sockaddr_dl__: *mut sockaddr_dl,
    pub __sockaddr_eon__: *mut sockaddr_eon,
    pub __sockaddr_in__: *mut sockaddr_in,
    pub __sockaddr_in6__: *mut sockaddr_in6,
    pub __sockaddr_inarp__: *mut sockaddr_inarp,
    pub __sockaddr_ipx__: *mut sockaddr_ipx,
    pub __sockaddr_iso__: *mut sockaddr_iso,
    pub __sockaddr_ns__: *mut sockaddr_ns,
    pub __sockaddr_un__: *mut sockaddr_un,
    pub __sockaddr_x25__: *mut sockaddr_x25,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout___SOCKADDR_ARG() {
    assert_eq!(
        ::std::mem::size_of::<__SOCKADDR_ARG>(),
        8usize,
        concat!("Size of: ", stringify!(__SOCKADDR_ARG))
    );
    assert_eq!(
        ::std::mem::align_of::<__SOCKADDR_ARG>(),
        8usize,
        concat!("Alignment of ", stringify!(__SOCKADDR_ARG))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__SOCKADDR_ARG>())).__sockaddr__ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__SOCKADDR_ARG),
            "::",
            stringify!(__sockaddr__)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__SOCKADDR_ARG>())).__sockaddr_at__ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__SOCKADDR_ARG),
            "::",
            stringify!(__sockaddr_at__)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__SOCKADDR_ARG>())).__sockaddr_ax25__ as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__SOCKADDR_ARG),
            "::",
            stringify!(__sockaddr_ax25__)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__SOCKADDR_ARG>())).__sockaddr_dl__ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__SOCKADDR_ARG),
            "::",
            stringify!(__sockaddr_dl__)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__SOCKADDR_ARG>())).__sockaddr_eon__ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__SOCKADDR_ARG),
            "::",
            stringify!(__sockaddr_eon__)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__SOCKADDR_ARG>())).__sockaddr_in__ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__SOCKADDR_ARG),
            "::",
            stringify!(__sockaddr_in__)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__SOCKADDR_ARG>())).__sockaddr_in6__ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__SOCKADDR_ARG),
            "::",
            stringify!(__sockaddr_in6__)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__SOCKADDR_ARG>())).__sockaddr_inarp__ as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__SOCKADDR_ARG),
            "::",
            stringify!(__sockaddr_inarp__)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__SOCKADDR_ARG>())).__sockaddr_ipx__ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__SOCKADDR_ARG),
            "::",
            stringify!(__sockaddr_ipx__)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__SOCKADDR_ARG>())).__sockaddr_iso__ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__SOCKADDR_ARG),
            "::",
            stringify!(__sockaddr_iso__)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__SOCKADDR_ARG>())).__sockaddr_ns__ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__SOCKADDR_ARG),
            "::",
            stringify!(__sockaddr_ns__)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__SOCKADDR_ARG>())).__sockaddr_un__ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__SOCKADDR_ARG),
            "::",
            stringify!(__sockaddr_un__)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__SOCKADDR_ARG>())).__sockaddr_x25__ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__SOCKADDR_ARG),
            "::",
            stringify!(__sockaddr_x25__)
        )
    );
}
impl Default for __SOCKADDR_ARG {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __CONST_SOCKADDR_ARG {
    pub __sockaddr__: *const sockaddr,
    pub __sockaddr_at__: *const sockaddr_at,
    pub __sockaddr_ax25__: *const sockaddr_ax25,
    pub __sockaddr_dl__: *const sockaddr_dl,
    pub __sockaddr_eon__: *const sockaddr_eon,
    pub __sockaddr_in__: *const sockaddr_in,
    pub __sockaddr_in6__: *const sockaddr_in6,
    pub __sockaddr_inarp__: *const sockaddr_inarp,
    pub __sockaddr_ipx__: *const sockaddr_ipx,
    pub __sockaddr_iso__: *const sockaddr_iso,
    pub __sockaddr_ns__: *const sockaddr_ns,
    pub __sockaddr_un__: *const sockaddr_un,
    pub __sockaddr_x25__: *const sockaddr_x25,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout___CONST_SOCKADDR_ARG() {
    assert_eq!(
        ::std::mem::size_of::<__CONST_SOCKADDR_ARG>(),
        8usize,
        concat!("Size of: ", stringify!(__CONST_SOCKADDR_ARG))
    );
    assert_eq!(
        ::std::mem::align_of::<__CONST_SOCKADDR_ARG>(),
        8usize,
        concat!("Alignment of ", stringify!(__CONST_SOCKADDR_ARG))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__CONST_SOCKADDR_ARG>())).__sockaddr__ as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__CONST_SOCKADDR_ARG),
            "::",
            stringify!(__sockaddr__)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__CONST_SOCKADDR_ARG>())).__sockaddr_at__ as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__CONST_SOCKADDR_ARG),
            "::",
            stringify!(__sockaddr_at__)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__CONST_SOCKADDR_ARG>())).__sockaddr_ax25__ as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__CONST_SOCKADDR_ARG),
            "::",
            stringify!(__sockaddr_ax25__)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__CONST_SOCKADDR_ARG>())).__sockaddr_dl__ as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__CONST_SOCKADDR_ARG),
            "::",
            stringify!(__sockaddr_dl__)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__CONST_SOCKADDR_ARG>())).__sockaddr_eon__ as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__CONST_SOCKADDR_ARG),
            "::",
            stringify!(__sockaddr_eon__)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__CONST_SOCKADDR_ARG>())).__sockaddr_in__ as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__CONST_SOCKADDR_ARG),
            "::",
            stringify!(__sockaddr_in__)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__CONST_SOCKADDR_ARG>())).__sockaddr_in6__ as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__CONST_SOCKADDR_ARG),
            "::",
            stringify!(__sockaddr_in6__)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__CONST_SOCKADDR_ARG>())).__sockaddr_inarp__ as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__CONST_SOCKADDR_ARG),
            "::",
            stringify!(__sockaddr_inarp__)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__CONST_SOCKADDR_ARG>())).__sockaddr_ipx__ as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__CONST_SOCKADDR_ARG),
            "::",
            stringify!(__sockaddr_ipx__)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__CONST_SOCKADDR_ARG>())).__sockaddr_iso__ as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__CONST_SOCKADDR_ARG),
            "::",
            stringify!(__sockaddr_iso__)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__CONST_SOCKADDR_ARG>())).__sockaddr_ns__ as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__CONST_SOCKADDR_ARG),
            "::",
            stringify!(__sockaddr_ns__)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__CONST_SOCKADDR_ARG>())).__sockaddr_un__ as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__CONST_SOCKADDR_ARG),
            "::",
            stringify!(__sockaddr_un__)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__CONST_SOCKADDR_ARG>())).__sockaddr_x25__ as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__CONST_SOCKADDR_ARG),
            "::",
            stringify!(__sockaddr_x25__)
        )
    );
}
impl Default for __CONST_SOCKADDR_ARG {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mmsghdr {
    pub msg_hdr: msghdr,
    pub msg_len: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_mmsghdr() {
    assert_eq!(
        ::std::mem::size_of::<mmsghdr>(),
        64usize,
        concat!("Size of: ", stringify!(mmsghdr))
    );
    assert_eq!(
        ::std::mem::align_of::<mmsghdr>(),
        8usize,
        concat!("Alignment of ", stringify!(mmsghdr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<mmsghdr>())).msg_hdr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mmsghdr),
            "::",
            stringify!(msg_hdr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<mmsghdr>())).msg_len as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(mmsghdr),
            "::",
            stringify!(msg_len)
        )
    );
}
impl Default for mmsghdr {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
extern "C" {
    pub fn socket(
        __domain: ::std::os::raw::c_int,
        __type: ::std::os::raw::c_int,
        __protocol: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn socketpair(
        __domain: ::std::os::raw::c_int,
        __type: ::std::os::raw::c_int,
        __protocol: ::std::os::raw::c_int,
        __fds: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bind(
        __fd: ::std::os::raw::c_int,
        __addr: __CONST_SOCKADDR_ARG,
        __len: socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getsockname(
        __fd: ::std::os::raw::c_int,
        __addr: __SOCKADDR_ARG,
        __len: *mut socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn connect(
        __fd: ::std::os::raw::c_int,
        __addr: __CONST_SOCKADDR_ARG,
        __len: socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getpeername(
        __fd: ::std::os::raw::c_int,
        __addr: __SOCKADDR_ARG,
        __len: *mut socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn send(
        __fd: ::std::os::raw::c_int,
        __buf: *const ::std::os::raw::c_void,
        __n: size_t,
        __flags: ::std::os::raw::c_int,
    ) -> ssize_t;
}
extern "C" {
    pub fn recv(
        __fd: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_void,
        __n: size_t,
        __flags: ::std::os::raw::c_int,
    ) -> ssize_t;
}
extern "C" {
    pub fn sendto(
        __fd: ::std::os::raw::c_int,
        __buf: *const ::std::os::raw::c_void,
        __n: size_t,
        __flags: ::std::os::raw::c_int,
        __addr: __CONST_SOCKADDR_ARG,
        __addr_len: socklen_t,
    ) -> ssize_t;
}
extern "C" {
    pub fn recvfrom(
        __fd: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_void,
        __n: size_t,
        __flags: ::std::os::raw::c_int,
        __addr: __SOCKADDR_ARG,
        __addr_len: *mut socklen_t,
    ) -> ssize_t;
}
extern "C" {
    pub fn sendmsg(
        __fd: ::std::os::raw::c_int,
        __message: *const msghdr,
        __flags: ::std::os::raw::c_int,
    ) -> ssize_t;
}
extern "C" {
    pub fn sendmmsg(
        __fd: ::std::os::raw::c_int,
        __vmessages: *mut mmsghdr,
        __vlen: ::std::os::raw::c_uint,
        __flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn recvmsg(
        __fd: ::std::os::raw::c_int,
        __message: *mut msghdr,
        __flags: ::std::os::raw::c_int,
    ) -> ssize_t;
}
extern "C" {
    pub fn recvmmsg(
        __fd: ::std::os::raw::c_int,
        __vmessages: *mut mmsghdr,
        __vlen: ::std::os::raw::c_uint,
        __flags: ::std::os::raw::c_int,
        __tmo: *mut timespec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getsockopt(
        __fd: ::std::os::raw::c_int,
        __level: ::std::os::raw::c_int,
        __optname: ::std::os::raw::c_int,
        __optval: *mut ::std::os::raw::c_void,
        __optlen: *mut socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setsockopt(
        __fd: ::std::os::raw::c_int,
        __level: ::std::os::raw::c_int,
        __optname: ::std::os::raw::c_int,
        __optval: *const ::std::os::raw::c_void,
        __optlen: socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn listen(__fd: ::std::os::raw::c_int, __n: ::std::os::raw::c_int)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn accept(
        __fd: ::std::os::raw::c_int,
        __addr: __SOCKADDR_ARG,
        __addr_len: *mut socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn accept4(
        __fd: ::std::os::raw::c_int,
        __addr: __SOCKADDR_ARG,
        __addr_len: *mut socklen_t,
        __flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn shutdown(
        __fd: ::std::os::raw::c_int,
        __how: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sockatmark(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isfdtype(
        __fd: ::std::os::raw::c_int,
        __fdtype: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
pub type in_addr_t = u32;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct in_addr {
    pub s_addr: in_addr_t,
}
#[test]
fn bindgen_test_layout_in_addr() {
    assert_eq!(
        ::std::mem::size_of::<in_addr>(),
        4usize,
        concat!("Size of: ", stringify!(in_addr))
    );
    assert_eq!(
        ::std::mem::align_of::<in_addr>(),
        4usize,
        concat!("Alignment of ", stringify!(in_addr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<in_addr>())).s_addr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in_addr),
            "::",
            stringify!(s_addr)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ip_opts {
    pub ip_dst: in_addr,
    pub ip_opts: [::std::os::raw::c_char; 40usize],
}
#[test]
fn bindgen_test_layout_ip_opts() {
    assert_eq!(
        ::std::mem::size_of::<ip_opts>(),
        44usize,
        concat!("Size of: ", stringify!(ip_opts))
    );
    assert_eq!(
        ::std::mem::align_of::<ip_opts>(),
        4usize,
        concat!("Alignment of ", stringify!(ip_opts))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_opts>())).ip_dst as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_opts),
            "::",
            stringify!(ip_dst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_opts>())).ip_opts as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_opts),
            "::",
            stringify!(ip_opts)
        )
    );
}
impl Default for ip_opts {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ip_mreqn {
    pub imr_multiaddr: in_addr,
    pub imr_address: in_addr,
    pub imr_ifindex: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ip_mreqn() {
    assert_eq!(
        ::std::mem::size_of::<ip_mreqn>(),
        12usize,
        concat!("Size of: ", stringify!(ip_mreqn))
    );
    assert_eq!(
        ::std::mem::align_of::<ip_mreqn>(),
        4usize,
        concat!("Alignment of ", stringify!(ip_mreqn))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_mreqn>())).imr_multiaddr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_mreqn),
            "::",
            stringify!(imr_multiaddr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_mreqn>())).imr_address as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_mreqn),
            "::",
            stringify!(imr_address)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_mreqn>())).imr_ifindex as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_mreqn),
            "::",
            stringify!(imr_ifindex)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct in_pktinfo {
    pub ipi_ifindex: ::std::os::raw::c_int,
    pub ipi_spec_dst: in_addr,
    pub ipi_addr: in_addr,
}
#[test]
fn bindgen_test_layout_in_pktinfo() {
    assert_eq!(
        ::std::mem::size_of::<in_pktinfo>(),
        12usize,
        concat!("Size of: ", stringify!(in_pktinfo))
    );
    assert_eq!(
        ::std::mem::align_of::<in_pktinfo>(),
        4usize,
        concat!("Alignment of ", stringify!(in_pktinfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<in_pktinfo>())).ipi_ifindex as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in_pktinfo),
            "::",
            stringify!(ipi_ifindex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<in_pktinfo>())).ipi_spec_dst as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(in_pktinfo),
            "::",
            stringify!(ipi_spec_dst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<in_pktinfo>())).ipi_addr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(in_pktinfo),
            "::",
            stringify!(ipi_addr)
        )
    );
}
pub const IPPROTO_IP: _bindgen_ty_4 = 0;
pub const IPPROTO_ICMP: _bindgen_ty_4 = 1;
pub const IPPROTO_IGMP: _bindgen_ty_4 = 2;
pub const IPPROTO_IPIP: _bindgen_ty_4 = 4;
pub const IPPROTO_TCP: _bindgen_ty_4 = 6;
pub const IPPROTO_EGP: _bindgen_ty_4 = 8;
pub const IPPROTO_PUP: _bindgen_ty_4 = 12;
pub const IPPROTO_UDP: _bindgen_ty_4 = 17;
pub const IPPROTO_IDP: _bindgen_ty_4 = 22;
pub const IPPROTO_TP: _bindgen_ty_4 = 29;
pub const IPPROTO_DCCP: _bindgen_ty_4 = 33;
pub const IPPROTO_IPV6: _bindgen_ty_4 = 41;
pub const IPPROTO_RSVP: _bindgen_ty_4 = 46;
pub const IPPROTO_GRE: _bindgen_ty_4 = 47;
pub const IPPROTO_ESP: _bindgen_ty_4 = 50;
pub const IPPROTO_AH: _bindgen_ty_4 = 51;
pub const IPPROTO_MTP: _bindgen_ty_4 = 92;
pub const IPPROTO_BEETPH: _bindgen_ty_4 = 94;
pub const IPPROTO_ENCAP: _bindgen_ty_4 = 98;
pub const IPPROTO_PIM: _bindgen_ty_4 = 103;
pub const IPPROTO_COMP: _bindgen_ty_4 = 108;
pub const IPPROTO_SCTP: _bindgen_ty_4 = 132;
pub const IPPROTO_UDPLITE: _bindgen_ty_4 = 136;
pub const IPPROTO_MPLS: _bindgen_ty_4 = 137;
pub const IPPROTO_RAW: _bindgen_ty_4 = 255;
pub const IPPROTO_MAX: _bindgen_ty_4 = 256;
pub type _bindgen_ty_4 = u32;
pub const IPPROTO_HOPOPTS: _bindgen_ty_5 = 0;
pub const IPPROTO_ROUTING: _bindgen_ty_5 = 43;
pub const IPPROTO_FRAGMENT: _bindgen_ty_5 = 44;
pub const IPPROTO_ICMPV6: _bindgen_ty_5 = 58;
pub const IPPROTO_NONE: _bindgen_ty_5 = 59;
pub const IPPROTO_DSTOPTS: _bindgen_ty_5 = 60;
pub const IPPROTO_MH: _bindgen_ty_5 = 135;
pub type _bindgen_ty_5 = u32;
pub type in_port_t = u16;
pub const IPPORT_ECHO: _bindgen_ty_6 = 7;
pub const IPPORT_DISCARD: _bindgen_ty_6 = 9;
pub const IPPORT_SYSTAT: _bindgen_ty_6 = 11;
pub const IPPORT_DAYTIME: _bindgen_ty_6 = 13;
pub const IPPORT_NETSTAT: _bindgen_ty_6 = 15;
pub const IPPORT_FTP: _bindgen_ty_6 = 21;
pub const IPPORT_TELNET: _bindgen_ty_6 = 23;
pub const IPPORT_SMTP: _bindgen_ty_6 = 25;
pub const IPPORT_TIMESERVER: _bindgen_ty_6 = 37;
pub const IPPORT_NAMESERVER: _bindgen_ty_6 = 42;
pub const IPPORT_WHOIS: _bindgen_ty_6 = 43;
pub const IPPORT_MTP: _bindgen_ty_6 = 57;
pub const IPPORT_TFTP: _bindgen_ty_6 = 69;
pub const IPPORT_RJE: _bindgen_ty_6 = 77;
pub const IPPORT_FINGER: _bindgen_ty_6 = 79;
pub const IPPORT_TTYLINK: _bindgen_ty_6 = 87;
pub const IPPORT_SUPDUP: _bindgen_ty_6 = 95;
pub const IPPORT_EXECSERVER: _bindgen_ty_6 = 512;
pub const IPPORT_LOGINSERVER: _bindgen_ty_6 = 513;
pub const IPPORT_CMDSERVER: _bindgen_ty_6 = 514;
pub const IPPORT_EFSSERVER: _bindgen_ty_6 = 520;
pub const IPPORT_BIFFUDP: _bindgen_ty_6 = 512;
pub const IPPORT_WHOSERVER: _bindgen_ty_6 = 513;
pub const IPPORT_ROUTESERVER: _bindgen_ty_6 = 520;
pub const IPPORT_RESERVED: _bindgen_ty_6 = 1024;
pub const IPPORT_USERRESERVED: _bindgen_ty_6 = 5000;
pub type _bindgen_ty_6 = u32;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct in6_addr {
    pub __in6_u: in6_addr__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union in6_addr__bindgen_ty_1 {
    pub __u6_addr8: [u8; 16usize],
    pub __u6_addr16: [u16; 8usize],
    pub __u6_addr32: [u32; 4usize],
    _bindgen_union_align: [u32; 4usize],
}
#[test]
fn bindgen_test_layout_in6_addr__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<in6_addr__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(in6_addr__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<in6_addr__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(in6_addr__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<in6_addr__bindgen_ty_1>())).__u6_addr8 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_addr__bindgen_ty_1),
            "::",
            stringify!(__u6_addr8)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<in6_addr__bindgen_ty_1>())).__u6_addr16 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_addr__bindgen_ty_1),
            "::",
            stringify!(__u6_addr16)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<in6_addr__bindgen_ty_1>())).__u6_addr32 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_addr__bindgen_ty_1),
            "::",
            stringify!(__u6_addr32)
        )
    );
}
impl Default for in6_addr__bindgen_ty_1 {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[test]
fn bindgen_test_layout_in6_addr() {
    assert_eq!(
        ::std::mem::size_of::<in6_addr>(),
        16usize,
        concat!("Size of: ", stringify!(in6_addr))
    );
    assert_eq!(
        ::std::mem::align_of::<in6_addr>(),
        4usize,
        concat!("Alignment of ", stringify!(in6_addr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<in6_addr>())).__in6_u as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_addr),
            "::",
            stringify!(__in6_u)
        )
    );
}
impl Default for in6_addr {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
extern "C" {
    pub static in6addr_any: in6_addr;
}
extern "C" {
    pub static in6addr_loopback: in6_addr;
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct sockaddr_in {
    pub sin_family: sa_family_t,
    pub sin_port: in_port_t,
    pub sin_addr: in_addr,
    pub sin_zero: [::std::os::raw::c_uchar; 8usize],
}
#[test]
fn bindgen_test_layout_sockaddr_in() {
    assert_eq!(
        ::std::mem::size_of::<sockaddr_in>(),
        16usize,
        concat!("Size of: ", stringify!(sockaddr_in))
    );
    assert_eq!(
        ::std::mem::align_of::<sockaddr_in>(),
        4usize,
        concat!("Alignment of ", stringify!(sockaddr_in))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr_in>())).sin_family as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in),
            "::",
            stringify!(sin_family)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr_in>())).sin_port as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in),
            "::",
            stringify!(sin_port)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr_in>())).sin_addr as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in),
            "::",
            stringify!(sin_addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr_in>())).sin_zero as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in),
            "::",
            stringify!(sin_zero)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sockaddr_in6 {
    pub sin6_family: sa_family_t,
    pub sin6_port: in_port_t,
    pub sin6_flowinfo: u32,
    pub sin6_addr: in6_addr,
    pub sin6_scope_id: u32,
}
#[test]
fn bindgen_test_layout_sockaddr_in6() {
    assert_eq!(
        ::std::mem::size_of::<sockaddr_in6>(),
        28usize,
        concat!("Size of: ", stringify!(sockaddr_in6))
    );
    assert_eq!(
        ::std::mem::align_of::<sockaddr_in6>(),
        4usize,
        concat!("Alignment of ", stringify!(sockaddr_in6))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr_in6>())).sin6_family as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in6),
            "::",
            stringify!(sin6_family)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr_in6>())).sin6_port as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in6),
            "::",
            stringify!(sin6_port)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr_in6>())).sin6_flowinfo as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in6),
            "::",
            stringify!(sin6_flowinfo)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr_in6>())).sin6_addr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in6),
            "::",
            stringify!(sin6_addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr_in6>())).sin6_scope_id as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in6),
            "::",
            stringify!(sin6_scope_id)
        )
    );
}
impl Default for sockaddr_in6 {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ip_mreq {
    pub imr_multiaddr: in_addr,
    pub imr_interface: in_addr,
}
#[test]
fn bindgen_test_layout_ip_mreq() {
    assert_eq!(
        ::std::mem::size_of::<ip_mreq>(),
        8usize,
        concat!("Size of: ", stringify!(ip_mreq))
    );
    assert_eq!(
        ::std::mem::align_of::<ip_mreq>(),
        4usize,
        concat!("Alignment of ", stringify!(ip_mreq))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_mreq>())).imr_multiaddr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_mreq),
            "::",
            stringify!(imr_multiaddr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_mreq>())).imr_interface as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_mreq),
            "::",
            stringify!(imr_interface)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ip_mreq_source {
    pub imr_multiaddr: in_addr,
    pub imr_interface: in_addr,
    pub imr_sourceaddr: in_addr,
}
#[test]
fn bindgen_test_layout_ip_mreq_source() {
    assert_eq!(
        ::std::mem::size_of::<ip_mreq_source>(),
        12usize,
        concat!("Size of: ", stringify!(ip_mreq_source))
    );
    assert_eq!(
        ::std::mem::align_of::<ip_mreq_source>(),
        4usize,
        concat!("Alignment of ", stringify!(ip_mreq_source))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_mreq_source>())).imr_multiaddr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_mreq_source),
            "::",
            stringify!(imr_multiaddr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_mreq_source>())).imr_interface as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_mreq_source),
            "::",
            stringify!(imr_interface)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_mreq_source>())).imr_sourceaddr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_mreq_source),
            "::",
            stringify!(imr_sourceaddr)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ipv6_mreq {
    pub ipv6mr_multiaddr: in6_addr,
    pub ipv6mr_interface: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_ipv6_mreq() {
    assert_eq!(
        ::std::mem::size_of::<ipv6_mreq>(),
        20usize,
        concat!("Size of: ", stringify!(ipv6_mreq))
    );
    assert_eq!(
        ::std::mem::align_of::<ipv6_mreq>(),
        4usize,
        concat!("Alignment of ", stringify!(ipv6_mreq))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ipv6_mreq>())).ipv6mr_multiaddr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ipv6_mreq),
            "::",
            stringify!(ipv6mr_multiaddr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ipv6_mreq>())).ipv6mr_interface as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ipv6_mreq),
            "::",
            stringify!(ipv6mr_interface)
        )
    );
}
impl Default for ipv6_mreq {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct group_req {
    pub gr_interface: u32,
    pub gr_group: sockaddr_storage,
}
#[test]
fn bindgen_test_layout_group_req() {
    assert_eq!(
        ::std::mem::size_of::<group_req>(),
        136usize,
        concat!("Size of: ", stringify!(group_req))
    );
    assert_eq!(
        ::std::mem::align_of::<group_req>(),
        8usize,
        concat!("Alignment of ", stringify!(group_req))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<group_req>())).gr_interface as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(group_req),
            "::",
            stringify!(gr_interface)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<group_req>())).gr_group as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(group_req),
            "::",
            stringify!(gr_group)
        )
    );
}
impl Default for group_req {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct group_source_req {
    pub gsr_interface: u32,
    pub gsr_group: sockaddr_storage,
    pub gsr_source: sockaddr_storage,
}
#[test]
fn bindgen_test_layout_group_source_req() {
    assert_eq!(
        ::std::mem::size_of::<group_source_req>(),
        264usize,
        concat!("Size of: ", stringify!(group_source_req))
    );
    assert_eq!(
        ::std::mem::align_of::<group_source_req>(),
        8usize,
        concat!("Alignment of ", stringify!(group_source_req))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<group_source_req>())).gsr_interface as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(group_source_req),
            "::",
            stringify!(gsr_interface)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<group_source_req>())).gsr_group as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(group_source_req),
            "::",
            stringify!(gsr_group)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<group_source_req>())).gsr_source as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(group_source_req),
            "::",
            stringify!(gsr_source)
        )
    );
}
impl Default for group_source_req {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ip_msfilter {
    pub imsf_multiaddr: in_addr,
    pub imsf_interface: in_addr,
    pub imsf_fmode: u32,
    pub imsf_numsrc: u32,
    pub imsf_slist: [in_addr; 1usize],
}
#[test]
fn bindgen_test_layout_ip_msfilter() {
    assert_eq!(
        ::std::mem::size_of::<ip_msfilter>(),
        20usize,
        concat!("Size of: ", stringify!(ip_msfilter))
    );
    assert_eq!(
        ::std::mem::align_of::<ip_msfilter>(),
        4usize,
        concat!("Alignment of ", stringify!(ip_msfilter))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_msfilter>())).imsf_multiaddr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_msfilter),
            "::",
            stringify!(imsf_multiaddr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_msfilter>())).imsf_interface as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_msfilter),
            "::",
            stringify!(imsf_interface)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_msfilter>())).imsf_fmode as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_msfilter),
            "::",
            stringify!(imsf_fmode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_msfilter>())).imsf_numsrc as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_msfilter),
            "::",
            stringify!(imsf_numsrc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip_msfilter>())).imsf_slist as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_msfilter),
            "::",
            stringify!(imsf_slist)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct group_filter {
    pub gf_interface: u32,
    pub gf_group: sockaddr_storage,
    pub gf_fmode: u32,
    pub gf_numsrc: u32,
    pub gf_slist: [sockaddr_storage; 1usize],
}
#[test]
fn bindgen_test_layout_group_filter() {
    assert_eq!(
        ::std::mem::size_of::<group_filter>(),
        272usize,
        concat!("Size of: ", stringify!(group_filter))
    );
    assert_eq!(
        ::std::mem::align_of::<group_filter>(),
        8usize,
        concat!("Alignment of ", stringify!(group_filter))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<group_filter>())).gf_interface as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(group_filter),
            "::",
            stringify!(gf_interface)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<group_filter>())).gf_group as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(group_filter),
            "::",
            stringify!(gf_group)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<group_filter>())).gf_fmode as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(group_filter),
            "::",
            stringify!(gf_fmode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<group_filter>())).gf_numsrc as *const _ as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(group_filter),
            "::",
            stringify!(gf_numsrc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<group_filter>())).gf_slist as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(group_filter),
            "::",
            stringify!(gf_slist)
        )
    );
}
impl Default for group_filter {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
extern "C" {
    pub fn ntohl(__netlong: u32) -> u32;
}
extern "C" {
    pub fn ntohs(__netshort: u16) -> u16;
}
extern "C" {
    pub fn htonl(__hostlong: u32) -> u32;
}
extern "C" {
    pub fn htons(__hostshort: u16) -> u16;
}
extern "C" {
    pub fn bindresvport(
        __sockfd: ::std::os::raw::c_int,
        __sock_in: *mut sockaddr_in,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bindresvport6(
        __sockfd: ::std::os::raw::c_int,
        __sock_in: *mut sockaddr_in6,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct in6_pktinfo {
    pub ipi6_addr: in6_addr,
    pub ipi6_ifindex: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_in6_pktinfo() {
    assert_eq!(
        ::std::mem::size_of::<in6_pktinfo>(),
        20usize,
        concat!("Size of: ", stringify!(in6_pktinfo))
    );
    assert_eq!(
        ::std::mem::align_of::<in6_pktinfo>(),
        4usize,
        concat!("Alignment of ", stringify!(in6_pktinfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<in6_pktinfo>())).ipi6_addr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_pktinfo),
            "::",
            stringify!(ipi6_addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<in6_pktinfo>())).ipi6_ifindex as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_pktinfo),
            "::",
            stringify!(ipi6_ifindex)
        )
    );
}
impl Default for in6_pktinfo {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ip6_mtuinfo {
    pub ip6m_addr: sockaddr_in6,
    pub ip6m_mtu: u32,
}
#[test]
fn bindgen_test_layout_ip6_mtuinfo() {
    assert_eq!(
        ::std::mem::size_of::<ip6_mtuinfo>(),
        32usize,
        concat!("Size of: ", stringify!(ip6_mtuinfo))
    );
    assert_eq!(
        ::std::mem::align_of::<ip6_mtuinfo>(),
        4usize,
        concat!("Alignment of ", stringify!(ip6_mtuinfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip6_mtuinfo>())).ip6m_addr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ip6_mtuinfo),
            "::",
            stringify!(ip6m_addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ip6_mtuinfo>())).ip6m_mtu as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ip6_mtuinfo),
            "::",
            stringify!(ip6m_mtu)
        )
    );
}
impl Default for ip6_mtuinfo {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
extern "C" {
    pub fn inet6_option_space(__nbytes: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn inet6_option_init(
        __bp: *mut ::std::os::raw::c_void,
        __cmsgp: *mut *mut cmsghdr,
        __type: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn inet6_option_append(
        __cmsg: *mut cmsghdr,
        __typep: *const u8,
        __multx: ::std::os::raw::c_int,
        __plusy: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn inet6_option_alloc(
        __cmsg: *mut cmsghdr,
        __datalen: ::std::os::raw::c_int,
        __multx: ::std::os::raw::c_int,
        __plusy: ::std::os::raw::c_int,
    ) -> *mut u8;
}
extern "C" {
    pub fn inet6_option_next(
        __cmsg: *const cmsghdr,
        __tptrp: *mut *mut u8,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn inet6_option_find(
        __cmsg: *const cmsghdr,
        __tptrp: *mut *mut u8,
        __type: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn inet6_opt_init(
        __extbuf: *mut ::std::os::raw::c_void,
        __extlen: socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn inet6_opt_append(
        __extbuf: *mut ::std::os::raw::c_void,
        __extlen: socklen_t,
        __offset: ::std::os::raw::c_int,
        __type: u8,
        __len: socklen_t,
        __align: u8,
        __databufp: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn inet6_opt_finish(
        __extbuf: *mut ::std::os::raw::c_void,
        __extlen: socklen_t,
        __offset: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn inet6_opt_set_val(
        __databuf: *mut ::std::os::raw::c_void,
        __offset: ::std::os::raw::c_int,
        __val: *mut ::std::os::raw::c_void,
        __vallen: socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn inet6_opt_next(
        __extbuf: *mut ::std::os::raw::c_void,
        __extlen: socklen_t,
        __offset: ::std::os::raw::c_int,
        __typep: *mut u8,
        __lenp: *mut socklen_t,
        __databufp: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn inet6_opt_find(
        __extbuf: *mut ::std::os::raw::c_void,
        __extlen: socklen_t,
        __offset: ::std::os::raw::c_int,
        __type: u8,
        __lenp: *mut socklen_t,
        __databufp: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn inet6_opt_get_val(
        __databuf: *mut ::std::os::raw::c_void,
        __offset: ::std::os::raw::c_int,
        __val: *mut ::std::os::raw::c_void,
        __vallen: socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn inet6_rth_space(
        __type: ::std::os::raw::c_int,
        __segments: ::std::os::raw::c_int,
    ) -> socklen_t;
}
extern "C" {
    pub fn inet6_rth_init(
        __bp: *mut ::std::os::raw::c_void,
        __bp_len: socklen_t,
        __type: ::std::os::raw::c_int,
        __segments: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn inet6_rth_add(
        __bp: *mut ::std::os::raw::c_void,
        __addr: *const in6_addr,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn inet6_rth_reverse(
        __in: *const ::std::os::raw::c_void,
        __out: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn inet6_rth_segments(__bp: *const ::std::os::raw::c_void) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn inet6_rth_getaddr(
        __bp: *const ::std::os::raw::c_void,
        __index: ::std::os::raw::c_int,
    ) -> *mut in6_addr;
}
extern "C" {
    pub fn getipv4sourcefilter(
        __s: ::std::os::raw::c_int,
        __interface_addr: in_addr,
        __group: in_addr,
        __fmode: *mut u32,
        __numsrc: *mut u32,
        __slist: *mut in_addr,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setipv4sourcefilter(
        __s: ::std::os::raw::c_int,
        __interface_addr: in_addr,
        __group: in_addr,
        __fmode: u32,
        __numsrc: u32,
        __slist: *const in_addr,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getsourcefilter(
        __s: ::std::os::raw::c_int,
        __interface_addr: u32,
        __group: *const sockaddr,
        __grouplen: socklen_t,
        __fmode: *mut u32,
        __numsrc: *mut u32,
        __slist: *mut sockaddr_storage,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setsourcefilter(
        __s: ::std::os::raw::c_int,
        __interface_addr: u32,
        __group: *const sockaddr,
        __grouplen: socklen_t,
        __fmode: u32,
        __numsrc: u32,
        __slist: *const sockaddr_storage,
    ) -> ::std::os::raw::c_int;
}
pub type oid = u_long;
#[repr(C)]
#[derive(Copy, Clone)]
pub union netsnmp_vardata {
    pub integer: *mut ::std::os::raw::c_long,
    pub string: *mut u_char,
    pub objid: *mut oid,
    pub bitstring: *mut u_char,
    pub counter64: *mut counter64,
    pub floatVal: *mut f32,
    pub doubleVal: *mut f64,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_netsnmp_vardata() {
    assert_eq!(
        ::std::mem::size_of::<netsnmp_vardata>(),
        8usize,
        concat!("Size of: ", stringify!(netsnmp_vardata))
    );
    assert_eq!(
        ::std::mem::align_of::<netsnmp_vardata>(),
        8usize,
        concat!("Alignment of ", stringify!(netsnmp_vardata))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_vardata>())).integer as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_vardata),
            "::",
            stringify!(integer)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_vardata>())).string as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_vardata),
            "::",
            stringify!(string)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_vardata>())).objid as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_vardata),
            "::",
            stringify!(objid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_vardata>())).bitstring as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_vardata),
            "::",
            stringify!(bitstring)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_vardata>())).counter64 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_vardata),
            "::",
            stringify!(counter64)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_vardata>())).floatVal as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_vardata),
            "::",
            stringify!(floatVal)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_vardata>())).doubleVal as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_vardata),
            "::",
            stringify!(doubleVal)
        )
    );
}
impl Default for netsnmp_vardata {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct variable_list {
    pub next_variable: *mut variable_list,
    pub name: *mut oid,
    pub name_length: size_t,
    pub _type: u_char,
    pub val: netsnmp_vardata,
    pub val_len: size_t,
    pub name_loc: [oid; 128usize],
    pub buf: [u_char; 40usize],
    pub data: *mut ::std::os::raw::c_void,
    pub dataFreeHook:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub index: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_variable_list() {
    assert_eq!(
        ::std::mem::size_of::<variable_list>(),
        1136usize,
        concat!("Size of: ", stringify!(variable_list))
    );
    assert_eq!(
        ::std::mem::align_of::<variable_list>(),
        8usize,
        concat!("Alignment of ", stringify!(variable_list))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<variable_list>())).next_variable as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(variable_list),
            "::",
            stringify!(next_variable)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<variable_list>())).name as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(variable_list),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<variable_list>())).name_length as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(variable_list),
            "::",
            stringify!(name_length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<variable_list>())).type_ as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(variable_list),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<variable_list>())).val as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(variable_list),
            "::",
            stringify!(val)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<variable_list>())).val_len as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(variable_list),
            "::",
            stringify!(val_len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<variable_list>())).name_loc as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(variable_list),
            "::",
            stringify!(name_loc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<variable_list>())).buf as *const _ as usize },
        1072usize,
        concat!(
            "Offset of field: ",
            stringify!(variable_list),
            "::",
            stringify!(buf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<variable_list>())).data as *const _ as usize },
        1112usize,
        concat!(
            "Offset of field: ",
            stringify!(variable_list),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<variable_list>())).dataFreeHook as *const _ as usize },
        1120usize,
        concat!(
            "Offset of field: ",
            stringify!(variable_list),
            "::",
            stringify!(dataFreeHook)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<variable_list>())).index as *const _ as usize },
        1128usize,
        concat!(
            "Offset of field: ",
            stringify!(variable_list),
            "::",
            stringify!(index)
        )
    );
}
impl Default for variable_list {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type netsnmp_variable_list = variable_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct snmp_pdu {
    pub version: ::std::os::raw::c_long,
    pub command: ::std::os::raw::c_int,
    pub reqid: ::std::os::raw::c_long,
    pub msgid: ::std::os::raw::c_long,
    pub transid: ::std::os::raw::c_long,
    pub sessid: ::std::os::raw::c_long,
    pub errstat: ::std::os::raw::c_long,
    pub errindex: ::std::os::raw::c_long,
    pub time: u_long,
    pub flags: u_long,
    pub securityModel: ::std::os::raw::c_int,
    pub securityLevel: ::std::os::raw::c_int,
    pub msgParseModel: ::std::os::raw::c_int,
    pub msgMaxSize: ::std::os::raw::c_long,
    pub transport_data: *mut ::std::os::raw::c_void,
    pub transport_data_length: ::std::os::raw::c_int,
    pub tDomain: *const oid,
    pub tDomainLen: size_t,
    pub variables: *mut netsnmp_variable_list,
    pub community: *mut u_char,
    pub community_len: size_t,
    pub enterprise: *mut oid,
    pub enterprise_length: size_t,
    pub trap_type: ::std::os::raw::c_long,
    pub specific_type: ::std::os::raw::c_long,
    pub agent_addr: [::std::os::raw::c_uchar; 4usize],
    pub contextEngineID: *mut u_char,
    pub contextEngineIDLen: size_t,
    pub contextName: *mut ::std::os::raw::c_char,
    pub contextNameLen: size_t,
    pub securityEngineID: *mut u_char,
    pub securityEngineIDLen: size_t,
    pub securityName: *mut ::std::os::raw::c_char,
    pub securityNameLen: size_t,
    pub priority: ::std::os::raw::c_int,
    pub range_subid: ::std::os::raw::c_int,
    pub securityStateRef: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_snmp_pdu() {
    assert_eq!(
        ::std::mem::size_of::<snmp_pdu>(),
        280usize,
        concat!("Size of: ", stringify!(snmp_pdu))
    );
    assert_eq!(
        ::std::mem::align_of::<snmp_pdu>(),
        8usize,
        concat!("Alignment of ", stringify!(snmp_pdu))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_pdu>())).version as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_pdu),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_pdu>())).command as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_pdu),
            "::",
            stringify!(command)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_pdu>())).reqid as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_pdu),
            "::",
            stringify!(reqid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_pdu>())).msgid as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_pdu),
            "::",
            stringify!(msgid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_pdu>())).transid as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_pdu),
            "::",
            stringify!(transid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_pdu>())).sessid as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_pdu),
            "::",
            stringify!(sessid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_pdu>())).errstat as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_pdu),
            "::",
            stringify!(errstat)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_pdu>())).errindex as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_pdu),
            "::",
            stringify!(errindex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_pdu>())).time as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_pdu),
            "::",
            stringify!(time)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_pdu>())).flags as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_pdu),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_pdu>())).securityModel as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_pdu),
            "::",
            stringify!(securityModel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_pdu>())).securityLevel as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_pdu),
            "::",
            stringify!(securityLevel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_pdu>())).msgParseModel as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_pdu),
            "::",
            stringify!(msgParseModel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_pdu>())).msgMaxSize as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_pdu),
            "::",
            stringify!(msgMaxSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_pdu>())).transport_data as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_pdu),
            "::",
            stringify!(transport_data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_pdu>())).transport_data_length as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_pdu),
            "::",
            stringify!(transport_data_length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_pdu>())).tDomain as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_pdu),
            "::",
            stringify!(tDomain)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_pdu>())).tDomainLen as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_pdu),
            "::",
            stringify!(tDomainLen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_pdu>())).variables as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_pdu),
            "::",
            stringify!(variables)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_pdu>())).community as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_pdu),
            "::",
            stringify!(community)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_pdu>())).community_len as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_pdu),
            "::",
            stringify!(community_len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_pdu>())).enterprise as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_pdu),
            "::",
            stringify!(enterprise)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_pdu>())).enterprise_length as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_pdu),
            "::",
            stringify!(enterprise_length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_pdu>())).trap_type as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_pdu),
            "::",
            stringify!(trap_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_pdu>())).specific_type as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_pdu),
            "::",
            stringify!(specific_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_pdu>())).agent_addr as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_pdu),
            "::",
            stringify!(agent_addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_pdu>())).contextEngineID as *const _ as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_pdu),
            "::",
            stringify!(contextEngineID)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_pdu>())).contextEngineIDLen as *const _ as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_pdu),
            "::",
            stringify!(contextEngineIDLen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_pdu>())).contextName as *const _ as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_pdu),
            "::",
            stringify!(contextName)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_pdu>())).contextNameLen as *const _ as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_pdu),
            "::",
            stringify!(contextNameLen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_pdu>())).securityEngineID as *const _ as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_pdu),
            "::",
            stringify!(securityEngineID)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_pdu>())).securityEngineIDLen as *const _ as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_pdu),
            "::",
            stringify!(securityEngineIDLen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_pdu>())).securityName as *const _ as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_pdu),
            "::",
            stringify!(securityName)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_pdu>())).securityNameLen as *const _ as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_pdu),
            "::",
            stringify!(securityNameLen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_pdu>())).priority as *const _ as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_pdu),
            "::",
            stringify!(priority)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_pdu>())).range_subid as *const _ as usize },
        268usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_pdu),
            "::",
            stringify!(range_subid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_pdu>())).securityStateRef as *const _ as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_pdu),
            "::",
            stringify!(securityStateRef)
        )
    );
}
impl Default for snmp_pdu {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type netsnmp_pdu = snmp_pdu;
pub type netsnmp_session = snmp_session;
pub type snmp_callback = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: ::std::os::raw::c_int,
        arg2: *mut netsnmp_session,
        arg3: ::std::os::raw::c_int,
        arg4: *mut netsnmp_pdu,
        arg5: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type netsnmp_callback = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: ::std::os::raw::c_int,
        arg2: *mut netsnmp_session,
        arg3: ::std::os::raw::c_int,
        arg4: *mut netsnmp_pdu,
        arg5: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct netsnmp_trap_stats_s {
    pub sent_count: u_long,
    pub sent_last_sent: u_long,
    pub sent_fail_count: u_long,
    pub sent_last_fail: u_long,
    pub ack_count: u_long,
    pub ack_last_rcvd: u_long,
    pub sec_err_count: u_long,
    pub sec_err_last: u_long,
    pub timeouts: u_long,
    pub sent_last_timeout: u_long,
}
#[test]
fn bindgen_test_layout_netsnmp_trap_stats_s() {
    assert_eq!(
        ::std::mem::size_of::<netsnmp_trap_stats_s>(),
        80usize,
        concat!("Size of: ", stringify!(netsnmp_trap_stats_s))
    );
    assert_eq!(
        ::std::mem::align_of::<netsnmp_trap_stats_s>(),
        8usize,
        concat!("Alignment of ", stringify!(netsnmp_trap_stats_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_trap_stats_s>())).sent_count as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_trap_stats_s),
            "::",
            stringify!(sent_count)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<netsnmp_trap_stats_s>())).sent_last_sent as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_trap_stats_s),
            "::",
            stringify!(sent_last_sent)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<netsnmp_trap_stats_s>())).sent_fail_count as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_trap_stats_s),
            "::",
            stringify!(sent_fail_count)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<netsnmp_trap_stats_s>())).sent_last_fail as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_trap_stats_s),
            "::",
            stringify!(sent_last_fail)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_trap_stats_s>())).ack_count as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_trap_stats_s),
            "::",
            stringify!(ack_count)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<netsnmp_trap_stats_s>())).ack_last_rcvd as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_trap_stats_s),
            "::",
            stringify!(ack_last_rcvd)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<netsnmp_trap_stats_s>())).sec_err_count as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_trap_stats_s),
            "::",
            stringify!(sec_err_count)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<netsnmp_trap_stats_s>())).sec_err_last as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_trap_stats_s),
            "::",
            stringify!(sec_err_last)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_trap_stats_s>())).timeouts as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_trap_stats_s),
            "::",
            stringify!(timeouts)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<netsnmp_trap_stats_s>())).sent_last_timeout as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_trap_stats_s),
            "::",
            stringify!(sent_last_timeout)
        )
    );
}
pub type netsnmp_trap_stats = netsnmp_trap_stats_s;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct snmp_session {
    pub version: ::std::os::raw::c_long,
    pub retries: ::std::os::raw::c_int,
    pub timeout: ::std::os::raw::c_long,
    pub flags: u_long,
    pub subsession: *mut snmp_session,
    pub next: *mut snmp_session,
    pub peername: *mut ::std::os::raw::c_char,
    pub remote_port: u_short,
    pub localname: *mut ::std::os::raw::c_char,
    pub local_port: u_short,
    pub authenticator: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut u_char,
            arg2: *mut size_t,
            arg3: *mut u_char,
            arg4: size_t,
        ) -> *mut u_char,
    >,
    pub callback: netsnmp_callback,
    pub callback_magic: *mut ::std::os::raw::c_void,
    pub s_errno: ::std::os::raw::c_int,
    pub s_snmp_errno: ::std::os::raw::c_int,
    pub sessid: ::std::os::raw::c_long,
    pub community: *mut u_char,
    pub community_len: size_t,
    pub rcvMsgMaxSize: size_t,
    pub sndMsgMaxSize: size_t,
    pub isAuthoritative: u_char,
    pub contextEngineID: *mut u_char,
    pub contextEngineIDLen: size_t,
    pub engineBoots: u_int,
    pub engineTime: u_int,
    pub contextName: *mut ::std::os::raw::c_char,
    pub contextNameLen: size_t,
    pub securityEngineID: *mut u_char,
    pub securityEngineIDLen: size_t,
    pub securityName: *mut ::std::os::raw::c_char,
    pub securityNameLen: size_t,
    pub securityAuthProto: *mut oid,
    pub securityAuthProtoLen: size_t,
    pub securityAuthKey: [u_char; 64usize],
    pub securityAuthKeyLen: size_t,
    pub securityAuthLocalKey: *mut u_char,
    pub securityAuthLocalKeyLen: size_t,
    pub securityPrivProto: *mut oid,
    pub securityPrivProtoLen: size_t,
    pub securityPrivKey: [u_char; 64usize],
    pub securityPrivKeyLen: size_t,
    pub securityPrivLocalKey: *mut u_char,
    pub securityPrivLocalKeyLen: size_t,
    pub securityModel: ::std::os::raw::c_int,
    pub securityLevel: ::std::os::raw::c_int,
    pub paramName: *mut ::std::os::raw::c_char,
    pub trap_stats: *mut netsnmp_trap_stats,
    pub securityInfo: *mut ::std::os::raw::c_void,
    pub transport_configuration: *mut netsnmp_container_s,
    pub myvoid: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_snmp_session() {
    assert_eq!(
        ::std::mem::size_of::<snmp_session>(),
        488usize,
        concat!("Size of: ", stringify!(snmp_session))
    );
    assert_eq!(
        ::std::mem::align_of::<snmp_session>(),
        8usize,
        concat!("Alignment of ", stringify!(snmp_session))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_session>())).version as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_session>())).retries as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(retries)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_session>())).timeout as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(timeout)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_session>())).flags as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_session>())).subsession as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(subsession)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_session>())).next as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_session>())).peername as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(peername)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_session>())).remote_port as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(remote_port)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_session>())).localname as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(localname)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_session>())).local_port as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(local_port)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_session>())).authenticator as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(authenticator)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_session>())).callback as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(callback)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_session>())).callback_magic as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(callback_magic)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_session>())).s_errno as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(s_errno)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_session>())).s_snmp_errno as *const _ as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(s_snmp_errno)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_session>())).sessid as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(sessid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_session>())).community as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(community)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_session>())).community_len as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(community_len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_session>())).rcvMsgMaxSize as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(rcvMsgMaxSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_session>())).sndMsgMaxSize as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(sndMsgMaxSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_session>())).isAuthoritative as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(isAuthoritative)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_session>())).contextEngineID as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(contextEngineID)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_session>())).contextEngineIDLen as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(contextEngineIDLen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_session>())).engineBoots as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(engineBoots)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_session>())).engineTime as *const _ as usize },
        180usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(engineTime)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_session>())).contextName as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(contextName)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_session>())).contextNameLen as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(contextNameLen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_session>())).securityEngineID as *const _ as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(securityEngineID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<snmp_session>())).securityEngineIDLen as *const _ as usize
        },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(securityEngineIDLen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_session>())).securityName as *const _ as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(securityName)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_session>())).securityNameLen as *const _ as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(securityNameLen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_session>())).securityAuthProto as *const _ as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(securityAuthProto)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<snmp_session>())).securityAuthProtoLen as *const _ as usize
        },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(securityAuthProtoLen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_session>())).securityAuthKey as *const _ as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(securityAuthKey)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_session>())).securityAuthKeyLen as *const _ as usize },
        312usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(securityAuthKeyLen)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<snmp_session>())).securityAuthLocalKey as *const _ as usize
        },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(securityAuthLocalKey)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<snmp_session>())).securityAuthLocalKeyLen as *const _ as usize
        },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(securityAuthLocalKeyLen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_session>())).securityPrivProto as *const _ as usize },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(securityPrivProto)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<snmp_session>())).securityPrivProtoLen as *const _ as usize
        },
        344usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(securityPrivProtoLen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_session>())).securityPrivKey as *const _ as usize },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(securityPrivKey)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_session>())).securityPrivKeyLen as *const _ as usize },
        416usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(securityPrivKeyLen)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<snmp_session>())).securityPrivLocalKey as *const _ as usize
        },
        424usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(securityPrivLocalKey)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<snmp_session>())).securityPrivLocalKeyLen as *const _ as usize
        },
        432usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(securityPrivLocalKeyLen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_session>())).securityModel as *const _ as usize },
        440usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(securityModel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_session>())).securityLevel as *const _ as usize },
        444usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(securityLevel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_session>())).paramName as *const _ as usize },
        448usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(paramName)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_session>())).trap_stats as *const _ as usize },
        456usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(trap_stats)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_session>())).securityInfo as *const _ as usize },
        464usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(securityInfo)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<snmp_session>())).transport_configuration as *const _ as usize
        },
        472usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(transport_configuration)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_session>())).myvoid as *const _ as usize },
        480usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_session),
            "::",
            stringify!(myvoid)
        )
    );
}
impl Default for snmp_session {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct netsnmp_index_s {
    pub len: size_t,
    pub oids: *mut oid,
}
#[test]
fn bindgen_test_layout_netsnmp_index_s() {
    assert_eq!(
        ::std::mem::size_of::<netsnmp_index_s>(),
        16usize,
        concat!("Size of: ", stringify!(netsnmp_index_s))
    );
    assert_eq!(
        ::std::mem::align_of::<netsnmp_index_s>(),
        8usize,
        concat!("Alignment of ", stringify!(netsnmp_index_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_index_s>())).len as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_index_s),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_index_s>())).oids as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_index_s),
            "::",
            stringify!(oids)
        )
    );
}
impl Default for netsnmp_index_s {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type netsnmp_index = netsnmp_index_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct netsnmp_void_array_s {
    pub size: size_t,
    pub array: *mut *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_netsnmp_void_array_s() {
    assert_eq!(
        ::std::mem::size_of::<netsnmp_void_array_s>(),
        16usize,
        concat!("Size of: ", stringify!(netsnmp_void_array_s))
    );
    assert_eq!(
        ::std::mem::align_of::<netsnmp_void_array_s>(),
        8usize,
        concat!("Alignment of ", stringify!(netsnmp_void_array_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_void_array_s>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_void_array_s),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_void_array_s>())).array as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_void_array_s),
            "::",
            stringify!(array)
        )
    );
}
impl Default for netsnmp_void_array_s {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type netsnmp_void_array = netsnmp_void_array_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct netsnmp_ref_void {
    pub val: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_netsnmp_ref_void() {
    assert_eq!(
        ::std::mem::size_of::<netsnmp_ref_void>(),
        8usize,
        concat!("Size of: ", stringify!(netsnmp_ref_void))
    );
    assert_eq!(
        ::std::mem::align_of::<netsnmp_ref_void>(),
        8usize,
        concat!("Alignment of ", stringify!(netsnmp_ref_void))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_ref_void>())).val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_ref_void),
            "::",
            stringify!(val)
        )
    );
}
impl Default for netsnmp_ref_void {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union netsnmp_cvalue {
    pub ul: u_long,
    pub ui: u_int,
    pub us: u_short,
    pub uc: u_char,
    pub sl: ::std::os::raw::c_long,
    pub si: ::std::os::raw::c_int,
    pub ss: ::std::os::raw::c_short,
    pub sc: ::std::os::raw::c_char,
    pub cp: *mut ::std::os::raw::c_char,
    pub vp: *mut ::std::os::raw::c_void,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_netsnmp_cvalue() {
    assert_eq!(
        ::std::mem::size_of::<netsnmp_cvalue>(),
        8usize,
        concat!("Size of: ", stringify!(netsnmp_cvalue))
    );
    assert_eq!(
        ::std::mem::align_of::<netsnmp_cvalue>(),
        8usize,
        concat!("Alignment of ", stringify!(netsnmp_cvalue))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_cvalue>())).ul as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_cvalue),
            "::",
            stringify!(ul)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_cvalue>())).ui as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_cvalue),
            "::",
            stringify!(ui)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_cvalue>())).us as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_cvalue),
            "::",
            stringify!(us)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_cvalue>())).uc as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_cvalue),
            "::",
            stringify!(uc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_cvalue>())).sl as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_cvalue),
            "::",
            stringify!(sl)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_cvalue>())).si as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_cvalue),
            "::",
            stringify!(si)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_cvalue>())).ss as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_cvalue),
            "::",
            stringify!(ss)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_cvalue>())).sc as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_cvalue),
            "::",
            stringify!(sc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_cvalue>())).cp as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_cvalue),
            "::",
            stringify!(cp)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_cvalue>())).vp as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_cvalue),
            "::",
            stringify!(vp)
        )
    );
}
impl Default for netsnmp_cvalue {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct netsnmp_ref_size_t_s {
    pub val: size_t,
}
#[test]
fn bindgen_test_layout_netsnmp_ref_size_t_s() {
    assert_eq!(
        ::std::mem::size_of::<netsnmp_ref_size_t_s>(),
        8usize,
        concat!("Size of: ", stringify!(netsnmp_ref_size_t_s))
    );
    assert_eq!(
        ::std::mem::align_of::<netsnmp_ref_size_t_s>(),
        8usize,
        concat!("Alignment of ", stringify!(netsnmp_ref_size_t_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_ref_size_t_s>())).val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_ref_size_t_s),
            "::",
            stringify!(val)
        )
    );
}
pub type netsnmp_ref_size_t = *mut netsnmp_ref_size_t_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct netsnmp_large_fd_set_s {
    pub lfs_setsize: ::std::os::raw::c_uint,
    pub lfs_setptr: *mut fd_set,
    pub lfs_set: fd_set,
}
#[test]
fn bindgen_test_layout_netsnmp_large_fd_set_s() {
    assert_eq!(
        ::std::mem::size_of::<netsnmp_large_fd_set_s>(),
        144usize,
        concat!("Size of: ", stringify!(netsnmp_large_fd_set_s))
    );
    assert_eq!(
        ::std::mem::align_of::<netsnmp_large_fd_set_s>(),
        8usize,
        concat!("Alignment of ", stringify!(netsnmp_large_fd_set_s))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<netsnmp_large_fd_set_s>())).lfs_setsize as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_large_fd_set_s),
            "::",
            stringify!(lfs_setsize)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<netsnmp_large_fd_set_s>())).lfs_setptr as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_large_fd_set_s),
            "::",
            stringify!(lfs_setptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_large_fd_set_s>())).lfs_set as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_large_fd_set_s),
            "::",
            stringify!(lfs_set)
        )
    );
}
impl Default for netsnmp_large_fd_set_s {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type netsnmp_large_fd_set = netsnmp_large_fd_set_s;
extern "C" {
    pub fn snmp_pdu_add_variable(
        pdu: *mut netsnmp_pdu,
        name: *const oid,
        name_length: size_t,
        type_: u_char,
        value: *const ::std::os::raw::c_void,
        len: size_t,
    ) -> *mut netsnmp_variable_list;
}
extern "C" {
    pub fn snmp_varlist_add_variable(
        varlist: *mut *mut netsnmp_variable_list,
        name: *const oid,
        name_length: size_t,
        type_: u_char,
        value: *const ::std::os::raw::c_void,
        len: size_t,
    ) -> *mut netsnmp_variable_list;
}
extern "C" {
    pub fn snmp_add_null_var(
        pdu: *mut netsnmp_pdu,
        name: *const oid,
        name_length: size_t,
    ) -> *mut netsnmp_variable_list;
}
extern "C" {
    pub fn snmp_clone_varbind(varlist: *mut netsnmp_variable_list) -> *mut netsnmp_variable_list;
}
extern "C" {
    pub fn snmp_set_var_objid(
        var: *mut netsnmp_variable_list,
        name: *const oid,
        name_length: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snmp_set_var_value(
        var: *mut netsnmp_variable_list,
        value: *const ::std::os::raw::c_void,
        len: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snmp_set_var_typed_value(
        var: *mut netsnmp_variable_list,
        type_: u_char,
        value: *const ::std::os::raw::c_void,
        len: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snmp_set_var_typed_integer(
        var: *mut netsnmp_variable_list,
        type_: u_char,
        val: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn print_variable(
        objid: *const oid,
        objidlen: size_t,
        variable: *const netsnmp_variable_list,
    );
}
extern "C" {
    pub fn fprint_variable(
        fp: *mut FILE,
        objid: *const oid,
        objidlen: size_t,
        variable: *const netsnmp_variable_list,
    );
}
extern "C" {
    pub fn snprint_variable(
        buf: *mut ::std::os::raw::c_char,
        buf_len: size_t,
        objid: *const oid,
        objidlen: size_t,
        variable: *const netsnmp_variable_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn print_value(objid: *const oid, objidlen: size_t, variable: *const netsnmp_variable_list);
}
extern "C" {
    pub fn fprint_value(
        fp: *mut FILE,
        objid: *const oid,
        objidlen: size_t,
        variable: *const netsnmp_variable_list,
    );
}
extern "C" {
    pub fn snprint_value(
        buf: *mut ::std::os::raw::c_char,
        buf_len: size_t,
        objid: *const oid,
        objidlen: size_t,
        variable: *const netsnmp_variable_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snmp_free_var(var: *mut netsnmp_variable_list);
}
extern "C" {
    pub fn snmp_free_varbind(varlist: *mut netsnmp_variable_list);
}
extern "C" {
    pub fn snmp_pdu_create(type_: ::std::os::raw::c_int) -> *mut netsnmp_pdu;
}
extern "C" {
    pub fn snmp_clone_pdu(pdu: *mut netsnmp_pdu) -> *mut netsnmp_pdu;
}
extern "C" {
    pub fn snmp_fix_pdu(pdu: *mut netsnmp_pdu, idx: ::std::os::raw::c_int) -> *mut netsnmp_pdu;
}
extern "C" {
    pub fn snmp_free_pdu(pdu: *mut netsnmp_pdu);
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct counter64 {
    pub high: u_long,
    pub low: u_long,
}
#[test]
fn bindgen_test_layout_counter64() {
    assert_eq!(
        ::std::mem::size_of::<counter64>(),
        16usize,
        concat!("Size of: ", stringify!(counter64))
    );
    assert_eq!(
        ::std::mem::align_of::<counter64>(),
        8usize,
        concat!("Alignment of ", stringify!(counter64))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<counter64>())).high as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(counter64),
            "::",
            stringify!(high)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<counter64>())).low as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(counter64),
            "::",
            stringify!(low)
        )
    );
}
pub type integer64 = counter64;
pub type unsigned64 = counter64;
extern "C" {
    pub fn asn_check_packet(arg1: *mut u_char, arg2: size_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn asn_parse_int(
        arg1: *mut u_char,
        arg2: *mut size_t,
        arg3: *mut u_char,
        arg4: *mut ::std::os::raw::c_long,
        arg5: size_t,
    ) -> *mut u_char;
}
extern "C" {
    pub fn asn_build_int(
        arg1: *mut u_char,
        arg2: *mut size_t,
        arg3: u_char,
        arg4: *const ::std::os::raw::c_long,
        arg5: size_t,
    ) -> *mut u_char;
}
extern "C" {
    pub fn asn_parse_unsigned_int(
        arg1: *mut u_char,
        arg2: *mut size_t,
        arg3: *mut u_char,
        arg4: *mut u_long,
        arg5: size_t,
    ) -> *mut u_char;
}
extern "C" {
    pub fn asn_build_unsigned_int(
        arg1: *mut u_char,
        arg2: *mut size_t,
        arg3: u_char,
        arg4: *const u_long,
        arg5: size_t,
    ) -> *mut u_char;
}
extern "C" {
    pub fn asn_parse_string(
        arg1: *mut u_char,
        arg2: *mut size_t,
        arg3: *mut u_char,
        arg4: *mut u_char,
        arg5: *mut size_t,
    ) -> *mut u_char;
}
extern "C" {
    pub fn asn_build_string(
        arg1: *mut u_char,
        arg2: *mut size_t,
        arg3: u_char,
        arg4: *const u_char,
        arg5: size_t,
    ) -> *mut u_char;
}
extern "C" {
    pub fn asn_parse_header(arg1: *mut u_char, arg2: *mut size_t, arg3: *mut u_char)
        -> *mut u_char;
}
extern "C" {
    pub fn asn_parse_sequence(
        arg1: *mut u_char,
        arg2: *mut size_t,
        arg3: *mut u_char,
        expected_type: u_char,
        estr: *const ::std::os::raw::c_char,
    ) -> *mut u_char;
}
extern "C" {
    pub fn asn_build_header(
        arg1: *mut u_char,
        arg2: *mut size_t,
        arg3: u_char,
        arg4: size_t,
    ) -> *mut u_char;
}
extern "C" {
    pub fn asn_build_sequence(
        arg1: *mut u_char,
        arg2: *mut size_t,
        arg3: u_char,
        arg4: size_t,
    ) -> *mut u_char;
}
extern "C" {
    pub fn asn_parse_length(arg1: *mut u_char, arg2: *mut u_long) -> *mut u_char;
}
extern "C" {
    pub fn asn_build_length(arg1: *mut u_char, arg2: *mut size_t, arg3: size_t) -> *mut u_char;
}
extern "C" {
    pub fn asn_parse_objid(
        arg1: *mut u_char,
        arg2: *mut size_t,
        arg3: *mut u_char,
        arg4: *mut oid,
        arg5: *mut size_t,
    ) -> *mut u_char;
}
extern "C" {
    pub fn asn_build_objid(
        arg1: *mut u_char,
        arg2: *mut size_t,
        arg3: u_char,
        arg4: *mut oid,
        arg5: size_t,
    ) -> *mut u_char;
}
extern "C" {
    pub fn asn_parse_null(arg1: *mut u_char, arg2: *mut size_t, arg3: *mut u_char) -> *mut u_char;
}
extern "C" {
    pub fn asn_build_null(arg1: *mut u_char, arg2: *mut size_t, arg3: u_char) -> *mut u_char;
}
extern "C" {
    pub fn asn_parse_bitstring(
        arg1: *mut u_char,
        arg2: *mut size_t,
        arg3: *mut u_char,
        arg4: *mut u_char,
        arg5: *mut size_t,
    ) -> *mut u_char;
}
extern "C" {
    pub fn asn_build_bitstring(
        arg1: *mut u_char,
        arg2: *mut size_t,
        arg3: u_char,
        arg4: *const u_char,
        arg5: size_t,
    ) -> *mut u_char;
}
extern "C" {
    pub fn asn_parse_unsigned_int64(
        arg1: *mut u_char,
        arg2: *mut size_t,
        arg3: *mut u_char,
        arg4: *mut counter64,
        arg5: size_t,
    ) -> *mut u_char;
}
extern "C" {
    pub fn asn_build_unsigned_int64(
        arg1: *mut u_char,
        arg2: *mut size_t,
        arg3: u_char,
        arg4: *const counter64,
        arg5: size_t,
    ) -> *mut u_char;
}
extern "C" {
    pub fn asn_parse_signed_int64(
        arg1: *mut u_char,
        arg2: *mut size_t,
        arg3: *mut u_char,
        arg4: *mut counter64,
        arg5: size_t,
    ) -> *mut u_char;
}
extern "C" {
    pub fn asn_build_signed_int64(
        arg1: *mut u_char,
        arg2: *mut size_t,
        arg3: u_char,
        arg4: *const counter64,
        arg5: size_t,
    ) -> *mut u_char;
}
extern "C" {
    pub fn asn_build_float(
        arg1: *mut u_char,
        arg2: *mut size_t,
        arg3: u_char,
        arg4: *const f32,
        arg5: size_t,
    ) -> *mut u_char;
}
extern "C" {
    pub fn asn_parse_float(
        arg1: *mut u_char,
        arg2: *mut size_t,
        arg3: *mut u_char,
        arg4: *mut f32,
        arg5: size_t,
    ) -> *mut u_char;
}
extern "C" {
    pub fn asn_build_double(
        arg1: *mut u_char,
        arg2: *mut size_t,
        arg3: u_char,
        arg4: *const f64,
        arg5: size_t,
    ) -> *mut u_char;
}
extern "C" {
    pub fn asn_parse_double(
        arg1: *mut u_char,
        arg2: *mut size_t,
        arg3: *mut u_char,
        arg4: *mut f64,
        arg5: size_t,
    ) -> *mut u_char;
}
extern "C" {
    pub fn asn_realloc(arg1: *mut *mut u_char, arg2: *mut size_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn asn_realloc_rbuild_int(
        pkt: *mut *mut u_char,
        pkt_len: *mut size_t,
        offset: *mut size_t,
        allow_realloc: ::std::os::raw::c_int,
        type_: u_char,
        data: *const ::std::os::raw::c_long,
        data_size: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn asn_realloc_rbuild_string(
        pkt: *mut *mut u_char,
        pkt_len: *mut size_t,
        offset: *mut size_t,
        allow_realloc: ::std::os::raw::c_int,
        type_: u_char,
        data: *const u_char,
        data_size: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn asn_realloc_rbuild_unsigned_int(
        pkt: *mut *mut u_char,
        pkt_len: *mut size_t,
        offset: *mut size_t,
        allow_realloc: ::std::os::raw::c_int,
        type_: u_char,
        data: *const u_long,
        data_size: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn asn_realloc_rbuild_header(
        pkt: *mut *mut u_char,
        pkt_len: *mut size_t,
        offset: *mut size_t,
        allow_realloc: ::std::os::raw::c_int,
        type_: u_char,
        data_size: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn asn_realloc_rbuild_sequence(
        pkt: *mut *mut u_char,
        pkt_len: *mut size_t,
        offset: *mut size_t,
        allow_realloc: ::std::os::raw::c_int,
        type_: u_char,
        data_size: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn asn_realloc_rbuild_length(
        pkt: *mut *mut u_char,
        pkt_len: *mut size_t,
        offset: *mut size_t,
        allow_realloc: ::std::os::raw::c_int,
        data_size: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn asn_realloc_rbuild_objid(
        pkt: *mut *mut u_char,
        pkt_len: *mut size_t,
        offset: *mut size_t,
        allow_realloc: ::std::os::raw::c_int,
        type_: u_char,
        arg1: *const oid,
        arg2: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn asn_realloc_rbuild_null(
        pkt: *mut *mut u_char,
        pkt_len: *mut size_t,
        offset: *mut size_t,
        allow_realloc: ::std::os::raw::c_int,
        type_: u_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn asn_realloc_rbuild_bitstring(
        pkt: *mut *mut u_char,
        pkt_len: *mut size_t,
        offset: *mut size_t,
        allow_realloc: ::std::os::raw::c_int,
        type_: u_char,
        data: *const u_char,
        data_size: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn asn_realloc_rbuild_unsigned_int64(
        pkt: *mut *mut u_char,
        pkt_len: *mut size_t,
        offset: *mut size_t,
        allow_realloc: ::std::os::raw::c_int,
        type_: u_char,
        data: *const counter64,
        arg1: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn asn_realloc_rbuild_signed_int64(
        pkt: *mut *mut u_char,
        pkt_len: *mut size_t,
        offset: *mut size_t,
        allow_realloc: ::std::os::raw::c_int,
        type_: u_char,
        data: *const counter64,
        arg1: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn asn_realloc_rbuild_float(
        pkt: *mut *mut u_char,
        pkt_len: *mut size_t,
        offset: *mut size_t,
        allow_realloc: ::std::os::raw::c_int,
        type_: u_char,
        data: *const f32,
        data_size: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn asn_realloc_rbuild_double(
        pkt: *mut *mut u_char,
        pkt_len: *mut size_t,
        offset: *mut size_t,
        allow_realloc: ::std::os::raw::c_int,
        type_: u_char,
        data: *const f64,
        data_size: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snmp_error(
        sess: *mut netsnmp_session,
        clib_errorno: *mut ::std::os::raw::c_int,
        snmp_errorno: *mut ::std::os::raw::c_int,
        errstring: *mut *mut ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn snmp_sess_error(
        sess: *mut ::std::os::raw::c_void,
        clib_errorno: *mut ::std::os::raw::c_int,
        snmp_errorno: *mut ::std::os::raw::c_int,
        errstring: *mut *mut ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn snmp_api_errstring(snmp_errorno: ::std::os::raw::c_int)
        -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn snmp_errstring(snmp_errorno: ::std::os::raw::c_int) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn snmp_perror(msg: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn snmp_sess_perror(msg: *const ::std::os::raw::c_char, sess: *mut netsnmp_session);
}
extern "C" {
    pub fn snmp_log_perror(msg: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn snmp_log(
        priority: ::std::os::raw::c_int,
        format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snmp_vlog(
        priority: ::std::os::raw::c_int,
        format: *const ::std::os::raw::c_char,
        ap: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snmp_get_do_logging() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn netsnmp_logging_restart();
}
extern "C" {
    pub fn snmp_disable_log();
}
extern "C" {
    pub fn shutdown_snmp_logging();
}
extern "C" {
    pub fn debugmsg(
        token: *const ::std::os::raw::c_char,
        format: *const ::std::os::raw::c_char,
        ...
    );
}
extern "C" {
    pub fn debugmsgtoken(
        token: *const ::std::os::raw::c_char,
        format: *const ::std::os::raw::c_char,
        ...
    );
}
extern "C" {
    pub fn debug_combo_nc(
        token: *const ::std::os::raw::c_char,
        format: *const ::std::os::raw::c_char,
        ...
    );
}
extern "C" {
    pub fn debugmsg_oid(token: *const ::std::os::raw::c_char, theoid: *const oid, len: size_t);
}
extern "C" {
    pub fn debugmsg_suboid(token: *const ::std::os::raw::c_char, theoid: *const oid, len: size_t);
}
extern "C" {
    pub fn debugmsg_var(token: *const ::std::os::raw::c_char, var: *mut netsnmp_variable_list);
}
extern "C" {
    pub fn debugmsg_oidrange(
        token: *const ::std::os::raw::c_char,
        theoid: *const oid,
        len: size_t,
        var_subid: size_t,
        range_ubound: oid,
    );
}
extern "C" {
    pub fn debugmsg_hex(token: *const ::std::os::raw::c_char, thedata: *const u_char, len: size_t);
}
extern "C" {
    pub fn debugmsg_hextli(
        token: *const ::std::os::raw::c_char,
        thedata: *const u_char,
        len: size_t,
    );
}
extern "C" {
    pub fn debug_indent_add(amount: ::std::os::raw::c_int);
}
extern "C" {
    pub fn debug_indent_reset();
}
extern "C" {
    pub fn debug_indent_get() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn debug_indent() -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn snmp_debug_init();
}
extern "C" {
    pub fn snmp_debug_shutdown();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct netsnmp_token_descr_s {
    pub token_name: *mut ::std::os::raw::c_char,
    pub enabled: ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_netsnmp_token_descr_s() {
    assert_eq!(
        ::std::mem::size_of::<netsnmp_token_descr_s>(),
        16usize,
        concat!("Size of: ", stringify!(netsnmp_token_descr_s))
    );
    assert_eq!(
        ::std::mem::align_of::<netsnmp_token_descr_s>(),
        8usize,
        concat!("Alignment of ", stringify!(netsnmp_token_descr_s))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<netsnmp_token_descr_s>())).token_name as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_token_descr_s),
            "::",
            stringify!(token_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_token_descr_s>())).enabled as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_token_descr_s),
            "::",
            stringify!(enabled)
        )
    );
}
impl Default for netsnmp_token_descr_s {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type netsnmp_token_descr = netsnmp_token_descr_s;
extern "C" {
    pub static mut debug_num_tokens: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut dbg_tokens: [netsnmp_token_descr; 256usize];
}
extern "C" {
    pub fn debug_register_tokens(tokens: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn debug_enable_token_logs(token: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn debug_disable_token_logs(token: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn debug_is_token_registered(token: *const ::std::os::raw::c_char)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snmp_set_do_debugging(arg1: ::std::os::raw::c_int);
}
extern "C" {
    pub fn snmp_get_do_debugging() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn netsnmp_set_debug_log_level(val: ::std::os::raw::c_int);
}
extern "C" {
    pub fn netsnmp_get_debug_log_level() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn closelog();
}
extern "C" {
    pub fn openlog(
        __ident: *const ::std::os::raw::c_char,
        __option: ::std::os::raw::c_int,
        __facility: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn setlogmask(__mask: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn syslog(__pri: ::std::os::raw::c_int, __fmt: *const ::std::os::raw::c_char, ...);
}
extern "C" {
    pub fn vsyslog(
        __pri: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        __ap: *mut __va_list_tag,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct snmp_log_message {
    pub priority: ::std::os::raw::c_int,
    pub msg: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_snmp_log_message() {
    assert_eq!(
        ::std::mem::size_of::<snmp_log_message>(),
        16usize,
        concat!("Size of: ", stringify!(snmp_log_message))
    );
    assert_eq!(
        ::std::mem::align_of::<snmp_log_message>(),
        8usize,
        concat!("Alignment of ", stringify!(snmp_log_message))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_log_message>())).priority as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_log_message),
            "::",
            stringify!(priority)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_log_message>())).msg as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_log_message),
            "::",
            stringify!(msg)
        )
    );
}
impl Default for snmp_log_message {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
extern "C" {
    pub fn init_snmp_logging();
}
extern "C" {
    pub fn snmp_disable_syslog();
}
extern "C" {
    pub fn snmp_disable_filelog();
}
extern "C" {
    pub fn snmp_disable_stderrlog();
}
extern "C" {
    pub fn snmp_disable_calllog();
}
extern "C" {
    pub fn snmp_enable_syslog();
}
extern "C" {
    pub fn snmp_enable_syslog_ident(
        ident: *const ::std::os::raw::c_char,
        facility: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn snmp_enable_filelog(
        logfilename: *const ::std::os::raw::c_char,
        dont_zero_log: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn snmp_enable_stderrlog();
}
extern "C" {
    pub fn snmp_enable_calllog();
}
extern "C" {
    pub fn snmp_stderrlog_status() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn netsnmp_set_line_buffering(stream: *mut FILE);
}
extern "C" {
    pub fn snmp_log_options(
        optarg: *mut ::std::os::raw::c_char,
        argc: ::std::os::raw::c_int,
        argv: *const *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snmp_log_options_usage(lead: *const ::std::os::raw::c_char, outf: *mut FILE);
}
extern "C" {
    pub fn snmp_log_syslogname(
        syslogname: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
pub type netsnmp_log_handler = netsnmp_log_handler_s;
pub type NetsnmpLogHandler = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut netsnmp_log_handler,
        arg2: ::std::os::raw::c_int,
        arg3: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn log_handler_stdouterr(
        arg1: *mut netsnmp_log_handler,
        arg2: ::std::os::raw::c_int,
        arg3: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn log_handler_file(
        arg1: *mut netsnmp_log_handler,
        arg2: ::std::os::raw::c_int,
        arg3: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn log_handler_syslog(
        arg1: *mut netsnmp_log_handler,
        arg2: ::std::os::raw::c_int,
        arg3: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn log_handler_callback(
        arg1: *mut netsnmp_log_handler,
        arg2: ::std::os::raw::c_int,
        arg3: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn log_handler_null(
        arg1: *mut netsnmp_log_handler,
        arg2: ::std::os::raw::c_int,
        arg3: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct netsnmp_log_handler_s {
    pub enabled: ::std::os::raw::c_int,
    pub priority: ::std::os::raw::c_int,
    pub pri_max: ::std::os::raw::c_int,
    pub type_: ::std::os::raw::c_int,
    pub token: *const ::std::os::raw::c_char,
    pub handler: NetsnmpLogHandler,
    pub imagic: ::std::os::raw::c_int,
    pub magic: *mut ::std::os::raw::c_void,
    pub next: *mut netsnmp_log_handler,
    pub prev: *mut netsnmp_log_handler,
}
#[test]
fn bindgen_test_layout_netsnmp_log_handler_s() {
    assert_eq!(
        ::std::mem::size_of::<netsnmp_log_handler_s>(),
        64usize,
        concat!("Size of: ", stringify!(netsnmp_log_handler_s))
    );
    assert_eq!(
        ::std::mem::align_of::<netsnmp_log_handler_s>(),
        8usize,
        concat!("Alignment of ", stringify!(netsnmp_log_handler_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_log_handler_s>())).enabled as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_log_handler_s),
            "::",
            stringify!(enabled)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_log_handler_s>())).priority as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_log_handler_s),
            "::",
            stringify!(priority)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_log_handler_s>())).pri_max as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_log_handler_s),
            "::",
            stringify!(pri_max)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_log_handler_s>())).type_ as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_log_handler_s),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_log_handler_s>())).token as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_log_handler_s),
            "::",
            stringify!(token)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_log_handler_s>())).handler as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_log_handler_s),
            "::",
            stringify!(handler)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_log_handler_s>())).imagic as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_log_handler_s),
            "::",
            stringify!(imagic)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_log_handler_s>())).magic as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_log_handler_s),
            "::",
            stringify!(magic)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_log_handler_s>())).next as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_log_handler_s),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_log_handler_s>())).prev as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_log_handler_s),
            "::",
            stringify!(prev)
        )
    );
}
impl Default for netsnmp_log_handler_s {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
extern "C" {
    pub fn get_logh_head() -> *mut netsnmp_log_handler;
}
extern "C" {
    pub fn netsnmp_register_loghandler(
        type_: ::std::os::raw::c_int,
        pri: ::std::os::raw::c_int,
    ) -> *mut netsnmp_log_handler;
}
extern "C" {
    pub fn netsnmp_find_loghandler(
        token: *const ::std::os::raw::c_char,
    ) -> *mut netsnmp_log_handler;
}
extern "C" {
    pub fn netsnmp_add_loghandler(logh: *mut netsnmp_log_handler) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn netsnmp_remove_loghandler(logh: *mut netsnmp_log_handler) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn netsnmp_enable_loghandler(token: *const ::std::os::raw::c_char)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn netsnmp_disable_loghandler(
        token: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn netsnmp_enable_this_loghandler(logh: *mut netsnmp_log_handler);
}
extern "C" {
    pub fn netsnmp_disable_this_loghandler(logh: *mut netsnmp_log_handler);
}
extern "C" {
    pub fn netsnmp_create_stdio_loghandler(
        is_stdout: ::std::os::raw::c_int,
        priority: ::std::os::raw::c_int,
        priority_max: ::std::os::raw::c_int,
        tok: *const ::std::os::raw::c_char,
    ) -> *mut netsnmp_log_handler;
}
extern "C" {
    pub fn netsnmp_register_filelog_handler(
        logfilename: *const ::std::os::raw::c_char,
        priority: ::std::os::raw::c_int,
        priority_max: ::std::os::raw::c_int,
        dont_zero_log: ::std::os::raw::c_int,
    ) -> *mut netsnmp_log_handler;
}
extern "C" {
    pub fn snmp_sess_init(arg1: *mut netsnmp_session);
}
extern "C" {
    pub fn snmp_open(arg1: *mut netsnmp_session) -> *mut netsnmp_session;
}
extern "C" {
    pub fn snmp_close(arg1: *mut netsnmp_session) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snmp_close_sessions() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _build_initial_pdu_packet(
        slp: *mut session_list,
        pdu: *mut netsnmp_pdu,
        bulk: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snmp_send(arg1: *mut netsnmp_session, arg2: *mut netsnmp_pdu) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snmp_async_send(
        arg1: *mut netsnmp_session,
        arg2: *mut netsnmp_pdu,
        arg3: netsnmp_callback,
        arg4: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snmp_read(arg1: *mut fd_set);
}
extern "C" {
    pub fn snmp_read2(arg1: *mut netsnmp_large_fd_set);
}
extern "C" {
    pub fn snmp_synch_response(
        arg1: *mut netsnmp_session,
        arg2: *mut netsnmp_pdu,
        arg3: *mut *mut netsnmp_pdu,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snmp_select_info(
        arg1: *mut ::std::os::raw::c_int,
        arg2: *mut fd_set,
        arg3: *mut timeval,
        arg4: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snmp_select_info2(
        arg1: *mut ::std::os::raw::c_int,
        arg2: *mut netsnmp_large_fd_set,
        arg3: *mut timeval,
        arg4: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snmp_sess_select_info_flags(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *mut ::std::os::raw::c_int,
        arg3: *mut fd_set,
        arg4: *mut timeval,
        arg5: *mut ::std::os::raw::c_int,
        arg6: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snmp_sess_select_info2_flags(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *mut ::std::os::raw::c_int,
        arg3: *mut netsnmp_large_fd_set,
        arg4: *mut timeval,
        arg5: *mut ::std::os::raw::c_int,
        arg6: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snmp_timeout();
}
extern "C" {
    pub fn snmp_sess_open(arg1: *mut netsnmp_session) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn snmp_sess_pointer(arg1: *mut netsnmp_session) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn snmp_sess_session(arg1: *mut ::std::os::raw::c_void) -> *mut netsnmp_session;
}
extern "C" {
    pub fn snmp_sess_session_lookup(arg1: *mut ::std::os::raw::c_void) -> *mut netsnmp_session;
}
extern "C" {
    pub fn snmp_sess_lookup_by_name(
        paramName: *const ::std::os::raw::c_char,
    ) -> *mut netsnmp_session;
}
extern "C" {
    pub fn snmp_sess_send(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *mut netsnmp_pdu,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snmp_sess_async_send(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *mut netsnmp_pdu,
        arg3: netsnmp_callback,
        arg4: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snmp_sess_select_info(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *mut ::std::os::raw::c_int,
        arg3: *mut fd_set,
        arg4: *mut timeval,
        arg5: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snmp_sess_select_info2(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *mut ::std::os::raw::c_int,
        arg3: *mut netsnmp_large_fd_set,
        arg4: *mut timeval,
        arg5: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snmp_sess_read(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *mut fd_set,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snmp_sess_read2(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *mut netsnmp_large_fd_set,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snmp_sess_timeout(arg1: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn snmp_sess_close(arg1: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snmp_sess_synch_response(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *mut netsnmp_pdu,
        arg3: *mut *mut netsnmp_pdu,
    ) -> ::std::os::raw::c_int;
}
pub type SNMPCallback = ::std::option::Option<
    unsafe extern "C" fn(
        majorID: ::std::os::raw::c_int,
        minorID: ::std::os::raw::c_int,
        serverarg: *mut ::std::os::raw::c_void,
        clientarg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct snmp_gen_callback {
    pub sc_callback: SNMPCallback,
    pub sc_client_arg: *mut ::std::os::raw::c_void,
    pub priority: ::std::os::raw::c_int,
    pub next: *mut snmp_gen_callback,
}
#[test]
fn bindgen_test_layout_snmp_gen_callback() {
    assert_eq!(
        ::std::mem::size_of::<snmp_gen_callback>(),
        32usize,
        concat!("Size of: ", stringify!(snmp_gen_callback))
    );
    assert_eq!(
        ::std::mem::align_of::<snmp_gen_callback>(),
        8usize,
        concat!("Alignment of ", stringify!(snmp_gen_callback))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_gen_callback>())).sc_callback as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_gen_callback),
            "::",
            stringify!(sc_callback)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_gen_callback>())).sc_client_arg as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_gen_callback),
            "::",
            stringify!(sc_client_arg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_gen_callback>())).priority as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_gen_callback),
            "::",
            stringify!(priority)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<snmp_gen_callback>())).next as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(snmp_gen_callback),
            "::",
            stringify!(next)
        )
    );
}
impl Default for snmp_gen_callback {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
extern "C" {
    pub fn init_callbacks();
}
extern "C" {
    pub fn netsnmp_register_callback(
        major: ::std::os::raw::c_int,
        minor: ::std::os::raw::c_int,
        new_callback: SNMPCallback,
        arg: *mut ::std::os::raw::c_void,
        priority: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snmp_register_callback(
        major: ::std::os::raw::c_int,
        minor: ::std::os::raw::c_int,
        new_callback: SNMPCallback,
        arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snmp_call_callbacks(
        major: ::std::os::raw::c_int,
        minor: ::std::os::raw::c_int,
        caller_arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snmp_callback_available(
        major: ::std::os::raw::c_int,
        minor: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snmp_count_callbacks(
        major: ::std::os::raw::c_int,
        minor: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snmp_unregister_callback(
        major: ::std::os::raw::c_int,
        minor: ::std::os::raw::c_int,
        new_callback: SNMPCallback,
        arg: *mut ::std::os::raw::c_void,
        matchargs: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clear_callback();
}
extern "C" {
    pub fn netsnmp_callback_clear_client_arg(
        arg1: *mut ::std::os::raw::c_void,
        i: ::std::os::raw::c_int,
        j: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snmp_callback_list(
        major: ::std::os::raw::c_int,
        minor: ::std::os::raw::c_int,
    ) -> *mut snmp_gen_callback;
}
extern "C" {
    pub static mut netsnmpUDPDomain: [oid; 0usize];
}
extern "C" {
    pub static mut netsnmpCLNSDomain: [oid; 0usize];
}
extern "C" {
    pub static mut netsnmpCONSDomain: [oid; 0usize];
}
extern "C" {
    pub static mut netsnmpDDPDomain: [oid; 0usize];
}
extern "C" {
    pub static mut netsnmpIPXDomain: [oid; 0usize];
}
extern "C" {
    pub static mut netsnmpUDPDomain_len: size_t;
}
extern "C" {
    pub static mut netsnmpCLNSDomain_len: size_t;
}
extern "C" {
    pub static mut netsnmpCONSDomain_len: size_t;
}
extern "C" {
    pub static mut netsnmpDDPDomain_len: size_t;
}
extern "C" {
    pub static mut netsnmpIPXDomain_len: size_t;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union netsnmp_sockaddr_storage_u {
    pub sa: sockaddr,
    pub sin: sockaddr_in,
    pub sin6: sockaddr_in6,
    _bindgen_union_align: [u32; 7usize],
}
#[test]
fn bindgen_test_layout_netsnmp_sockaddr_storage_u() {
    assert_eq!(
        ::std::mem::size_of::<netsnmp_sockaddr_storage_u>(),
        28usize,
        concat!("Size of: ", stringify!(netsnmp_sockaddr_storage_u))
    );
    assert_eq!(
        ::std::mem::align_of::<netsnmp_sockaddr_storage_u>(),
        4usize,
        concat!("Alignment of ", stringify!(netsnmp_sockaddr_storage_u))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_sockaddr_storage_u>())).sa as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_sockaddr_storage_u),
            "::",
            stringify!(sa)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_sockaddr_storage_u>())).sin as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_sockaddr_storage_u),
            "::",
            stringify!(sin)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_sockaddr_storage_u>())).sin6 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_sockaddr_storage_u),
            "::",
            stringify!(sin6)
        )
    );
}
impl Default for netsnmp_sockaddr_storage_u {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type netsnmp_sockaddr_storage = netsnmp_sockaddr_storage_u;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct netsnmp_addr_pair_s {
    pub remote_addr: netsnmp_sockaddr_storage,
    pub local_addr: netsnmp_sockaddr_storage,
}
#[test]
fn bindgen_test_layout_netsnmp_addr_pair_s() {
    assert_eq!(
        ::std::mem::size_of::<netsnmp_addr_pair_s>(),
        56usize,
        concat!("Size of: ", stringify!(netsnmp_addr_pair_s))
    );
    assert_eq!(
        ::std::mem::align_of::<netsnmp_addr_pair_s>(),
        4usize,
        concat!("Alignment of ", stringify!(netsnmp_addr_pair_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_addr_pair_s>())).remote_addr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_addr_pair_s),
            "::",
            stringify!(remote_addr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_addr_pair_s>())).local_addr as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_addr_pair_s),
            "::",
            stringify!(local_addr)
        )
    );
}
impl Default for netsnmp_addr_pair_s {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type netsnmp_addr_pair = netsnmp_addr_pair_s;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct netsnmp_indexed_addr_pair_s {
    pub remote_addr: netsnmp_sockaddr_storage,
    pub local_addr: netsnmp_sockaddr_storage,
    pub if_index: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_netsnmp_indexed_addr_pair_s() {
    assert_eq!(
        ::std::mem::size_of::<netsnmp_indexed_addr_pair_s>(),
        60usize,
        concat!("Size of: ", stringify!(netsnmp_indexed_addr_pair_s))
    );
    assert_eq!(
        ::std::mem::align_of::<netsnmp_indexed_addr_pair_s>(),
        4usize,
        concat!("Alignment of ", stringify!(netsnmp_indexed_addr_pair_s))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<netsnmp_indexed_addr_pair_s>())).remote_addr as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_indexed_addr_pair_s),
            "::",
            stringify!(remote_addr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<netsnmp_indexed_addr_pair_s>())).local_addr as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_indexed_addr_pair_s),
            "::",
            stringify!(local_addr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<netsnmp_indexed_addr_pair_s>())).if_index as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_indexed_addr_pair_s),
            "::",
            stringify!(if_index)
        )
    );
}
impl Default for netsnmp_indexed_addr_pair_s {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type netsnmp_indexed_addr_pair = netsnmp_indexed_addr_pair_s;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct netsnmp_tmStateReference_s {
    pub transportDomain: [oid; 128usize],
    pub transportDomainLen: size_t,
    pub securityName: [::std::os::raw::c_char; 256usize],
    pub securityNameLen: size_t,
    pub requestedSecurityLevel: ::std::os::raw::c_int,
    pub transportSecurityLevel: ::std::os::raw::c_int,
    pub sameSecurity: ::std::os::raw::c_char,
    pub sessionID: [::std::os::raw::c_char; 8usize],
    pub have_addresses: ::std::os::raw::c_char,
    pub addresses: netsnmp_indexed_addr_pair,
    pub otherTransportOpaque: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_netsnmp_tmStateReference_s() {
    assert_eq!(
        ::std::mem::size_of::<netsnmp_tmStateReference_s>(),
        1384usize,
        concat!("Size of: ", stringify!(netsnmp_tmStateReference_s))
    );
    assert_eq!(
        ::std::mem::align_of::<netsnmp_tmStateReference_s>(),
        8usize,
        concat!("Alignment of ", stringify!(netsnmp_tmStateReference_s))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<netsnmp_tmStateReference_s>())).transportDomain as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_tmStateReference_s),
            "::",
            stringify!(transportDomain)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<netsnmp_tmStateReference_s>())).transportDomainLen as *const _
                as usize
        },
        1024usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_tmStateReference_s),
            "::",
            stringify!(transportDomainLen)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<netsnmp_tmStateReference_s>())).securityName as *const _ as usize
        },
        1032usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_tmStateReference_s),
            "::",
            stringify!(securityName)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<netsnmp_tmStateReference_s>())).securityNameLen as *const _
                as usize
        },
        1288usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_tmStateReference_s),
            "::",
            stringify!(securityNameLen)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<netsnmp_tmStateReference_s>())).requestedSecurityLevel
                as *const _ as usize
        },
        1296usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_tmStateReference_s),
            "::",
            stringify!(requestedSecurityLevel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<netsnmp_tmStateReference_s>())).transportSecurityLevel
                as *const _ as usize
        },
        1300usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_tmStateReference_s),
            "::",
            stringify!(transportSecurityLevel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<netsnmp_tmStateReference_s>())).sameSecurity as *const _ as usize
        },
        1304usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_tmStateReference_s),
            "::",
            stringify!(sameSecurity)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<netsnmp_tmStateReference_s>())).sessionID as *const _ as usize
        },
        1305usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_tmStateReference_s),
            "::",
            stringify!(sessionID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<netsnmp_tmStateReference_s>())).have_addresses as *const _
                as usize
        },
        1313usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_tmStateReference_s),
            "::",
            stringify!(have_addresses)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<netsnmp_tmStateReference_s>())).addresses as *const _ as usize
        },
        1316usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_tmStateReference_s),
            "::",
            stringify!(addresses)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<netsnmp_tmStateReference_s>())).otherTransportOpaque as *const _
                as usize
        },
        1376usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_tmStateReference_s),
            "::",
            stringify!(otherTransportOpaque)
        )
    );
}
impl Default for netsnmp_tmStateReference_s {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type netsnmp_tmStateReference = netsnmp_tmStateReference_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct netsnmp_tdomain_spec_s {
    pub application: *const ::std::os::raw::c_char,
    pub target: *const ::std::os::raw::c_char,
    pub flags: u_int,
    pub default_domain: *const ::std::os::raw::c_char,
    pub default_target: *const ::std::os::raw::c_char,
    pub source: *const ::std::os::raw::c_char,
    pub transport_config: *mut netsnmp_container_s,
}
#[test]
fn bindgen_test_layout_netsnmp_tdomain_spec_s() {
    assert_eq!(
        ::std::mem::size_of::<netsnmp_tdomain_spec_s>(),
        56usize,
        concat!("Size of: ", stringify!(netsnmp_tdomain_spec_s))
    );
    assert_eq!(
        ::std::mem::align_of::<netsnmp_tdomain_spec_s>(),
        8usize,
        concat!("Alignment of ", stringify!(netsnmp_tdomain_spec_s))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<netsnmp_tdomain_spec_s>())).application as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_tdomain_spec_s),
            "::",
            stringify!(application)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_tdomain_spec_s>())).target as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_tdomain_spec_s),
            "::",
            stringify!(target)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_tdomain_spec_s>())).flags as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_tdomain_spec_s),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<netsnmp_tdomain_spec_s>())).default_domain as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_tdomain_spec_s),
            "::",
            stringify!(default_domain)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<netsnmp_tdomain_spec_s>())).default_target as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_tdomain_spec_s),
            "::",
            stringify!(default_target)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_tdomain_spec_s>())).source as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_tdomain_spec_s),
            "::",
            stringify!(source)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<netsnmp_tdomain_spec_s>())).transport_config as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_tdomain_spec_s),
            "::",
            stringify!(transport_config)
        )
    );
}
impl Default for netsnmp_tdomain_spec_s {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type netsnmp_tdomain_spec = netsnmp_tdomain_spec_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct netsnmp_transport_s {
    pub domain: *const oid,
    pub domain_length: ::std::os::raw::c_int,
    pub local: *mut ::std::os::raw::c_void,
    pub local_length: ::std::os::raw::c_int,
    pub remote: *mut ::std::os::raw::c_void,
    pub remote_length: ::std::os::raw::c_int,
    pub sock: ::std::os::raw::c_int,
    pub flags: ::std::os::raw::c_uint,
    pub data: *mut ::std::os::raw::c_void,
    pub data_length: ::std::os::raw::c_int,
    pub msgMaxSize: size_t,
    pub base_transport: *mut netsnmp_transport_s,
    pub f_recv: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut netsnmp_transport_s,
            arg2: *mut ::std::os::raw::c_void,
            arg3: ::std::os::raw::c_int,
            arg4: *mut *mut ::std::os::raw::c_void,
            arg5: *mut ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub f_send: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut netsnmp_transport_s,
            arg2: *const ::std::os::raw::c_void,
            arg3: ::std::os::raw::c_int,
            arg4: *mut *mut ::std::os::raw::c_void,
            arg5: *mut ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    pub f_close: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut netsnmp_transport_s) -> ::std::os::raw::c_int,
    >,
    pub f_open: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut netsnmp_transport_s) -> *mut netsnmp_transport_s,
    >,
    pub f_accept: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut netsnmp_transport_s) -> ::std::os::raw::c_int,
    >,
    pub f_fmtaddr: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut netsnmp_transport_s,
            arg2: *const ::std::os::raw::c_void,
            arg3: ::std::os::raw::c_int,
        ) -> *mut ::std::os::raw::c_char,
    >,
    pub f_config: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut netsnmp_transport_s,
            arg2: *const ::std::os::raw::c_char,
            arg3: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int,
    >,
    pub f_copy: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *const netsnmp_transport_s,
            arg2: *mut netsnmp_transport_s,
        ) -> ::std::os::raw::c_int,
    >,
    pub f_setup_session: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut netsnmp_transport_s,
            arg2: *mut snmp_session,
        ) -> ::std::os::raw::c_int,
    >,
    pub identifier: *mut u_char,
    pub f_get_taddr: ::std::option::Option<
        unsafe extern "C" fn(
            t: *mut netsnmp_transport_s,
            addr: *mut *mut ::std::os::raw::c_void,
            addr_len: *mut size_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout_netsnmp_transport_s() {
    assert_eq!(
        ::std::mem::size_of::<netsnmp_transport_s>(),
        176usize,
        concat!("Size of: ", stringify!(netsnmp_transport_s))
    );
    assert_eq!(
        ::std::mem::align_of::<netsnmp_transport_s>(),
        8usize,
        concat!("Alignment of ", stringify!(netsnmp_transport_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_transport_s>())).domain as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_transport_s),
            "::",
            stringify!(domain)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<netsnmp_transport_s>())).domain_length as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_transport_s),
            "::",
            stringify!(domain_length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_transport_s>())).local as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_transport_s),
            "::",
            stringify!(local)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<netsnmp_transport_s>())).local_length as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_transport_s),
            "::",
            stringify!(local_length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_transport_s>())).remote as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_transport_s),
            "::",
            stringify!(remote)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<netsnmp_transport_s>())).remote_length as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_transport_s),
            "::",
            stringify!(remote_length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_transport_s>())).sock as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_transport_s),
            "::",
            stringify!(sock)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_transport_s>())).flags as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_transport_s),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_transport_s>())).data as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_transport_s),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_transport_s>())).data_length as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_transport_s),
            "::",
            stringify!(data_length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_transport_s>())).msgMaxSize as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_transport_s),
            "::",
            stringify!(msgMaxSize)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<netsnmp_transport_s>())).base_transport as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_transport_s),
            "::",
            stringify!(base_transport)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_transport_s>())).f_recv as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_transport_s),
            "::",
            stringify!(f_recv)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_transport_s>())).f_send as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_transport_s),
            "::",
            stringify!(f_send)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_transport_s>())).f_close as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_transport_s),
            "::",
            stringify!(f_close)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_transport_s>())).f_open as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_transport_s),
            "::",
            stringify!(f_open)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_transport_s>())).f_accept as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_transport_s),
            "::",
            stringify!(f_accept)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_transport_s>())).f_fmtaddr as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_transport_s),
            "::",
            stringify!(f_fmtaddr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_transport_s>())).f_config as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_transport_s),
            "::",
            stringify!(f_config)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_transport_s>())).f_copy as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_transport_s),
            "::",
            stringify!(f_copy)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<netsnmp_transport_s>())).f_setup_session as *const _ as usize
        },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_transport_s),
            "::",
            stringify!(f_setup_session)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_transport_s>())).identifier as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_transport_s),
            "::",
            stringify!(identifier)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_transport_s>())).f_get_taddr as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_transport_s),
            "::",
            stringify!(f_get_taddr)
        )
    );
}
impl Default for netsnmp_transport_s {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type netsnmp_transport = netsnmp_transport_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct netsnmp_transport_list_s {
    pub transport: *mut netsnmp_transport,
    pub next: *mut netsnmp_transport_list_s,
}
#[test]
fn bindgen_test_layout_netsnmp_transport_list_s() {
    assert_eq!(
        ::std::mem::size_of::<netsnmp_transport_list_s>(),
        16usize,
        concat!("Size of: ", stringify!(netsnmp_transport_list_s))
    );
    assert_eq!(
        ::std::mem::align_of::<netsnmp_transport_list_s>(),
        8usize,
        concat!("Alignment of ", stringify!(netsnmp_transport_list_s))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<netsnmp_transport_list_s>())).transport as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_transport_list_s),
            "::",
            stringify!(transport)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_transport_list_s>())).next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_transport_list_s),
            "::",
            stringify!(next)
        )
    );
}
impl Default for netsnmp_transport_list_s {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type netsnmp_transport_list = netsnmp_transport_list_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct netsnmp_tdomain_s {
    pub name: *const oid,
    pub name_length: size_t,
    pub prefix: *mut *const ::std::os::raw::c_char,
    pub f_create_from_tstring: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *const ::std::os::raw::c_char,
            arg2: ::std::os::raw::c_int,
        ) -> *mut netsnmp_transport,
    >,
    pub f_create_from_ostring: ::std::option::Option<
        unsafe extern "C" fn(
            o: *const ::std::os::raw::c_void,
            o_len: size_t,
            local: ::std::os::raw::c_int,
        ) -> *mut netsnmp_transport,
    >,
    pub next: *mut netsnmp_tdomain_s,
    pub f_create_from_tstring_new: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *const ::std::os::raw::c_char,
            arg2: ::std::os::raw::c_int,
            arg3: *const ::std::os::raw::c_char,
        ) -> *mut netsnmp_transport,
    >,
    pub f_create_from_tspec: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut netsnmp_tdomain_spec) -> *mut netsnmp_transport,
    >,
}
#[test]
fn bindgen_test_layout_netsnmp_tdomain_s() {
    assert_eq!(
        ::std::mem::size_of::<netsnmp_tdomain_s>(),
        64usize,
        concat!("Size of: ", stringify!(netsnmp_tdomain_s))
    );
    assert_eq!(
        ::std::mem::align_of::<netsnmp_tdomain_s>(),
        8usize,
        concat!("Alignment of ", stringify!(netsnmp_tdomain_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_tdomain_s>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_tdomain_s),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_tdomain_s>())).name_length as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_tdomain_s),
            "::",
            stringify!(name_length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_tdomain_s>())).prefix as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_tdomain_s),
            "::",
            stringify!(prefix)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<netsnmp_tdomain_s>())).f_create_from_tstring as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_tdomain_s),
            "::",
            stringify!(f_create_from_tstring)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<netsnmp_tdomain_s>())).f_create_from_ostring as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_tdomain_s),
            "::",
            stringify!(f_create_from_ostring)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_tdomain_s>())).next as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_tdomain_s),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<netsnmp_tdomain_s>())).f_create_from_tstring_new as *const _
                as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_tdomain_s),
            "::",
            stringify!(f_create_from_tstring_new)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<netsnmp_tdomain_s>())).f_create_from_tspec as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_tdomain_s),
            "::",
            stringify!(f_create_from_tspec)
        )
    );
}
impl Default for netsnmp_tdomain_s {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type netsnmp_tdomain = netsnmp_tdomain_s;
extern "C" {
    pub fn init_snmp_transport();
}
extern "C" {
    pub fn shutdown_snmp_transport();
}
extern "C" {
    pub fn netsnmp_transport_peer_string(
        t: *mut netsnmp_transport,
        data: *const ::std::os::raw::c_void,
        len: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn netsnmp_transport_send(
        t: *mut netsnmp_transport,
        data: *const ::std::os::raw::c_void,
        len: ::std::os::raw::c_int,
        opaque: *mut *mut ::std::os::raw::c_void,
        olength: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn netsnmp_transport_recv(
        t: *mut netsnmp_transport,
        data: *mut ::std::os::raw::c_void,
        len: ::std::os::raw::c_int,
        opaque: *mut *mut ::std::os::raw::c_void,
        olength: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn netsnmp_transport_add_to_list(
        transport_list: *mut *mut netsnmp_transport_list,
        transport: *mut netsnmp_transport,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn netsnmp_transport_remove_from_list(
        transport_list: *mut *mut netsnmp_transport_list,
        transport: *mut netsnmp_transport,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn netsnmp_sockaddr_size(sa: *const sockaddr) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn netsnmp_transport_copy(t: *const netsnmp_transport) -> *mut netsnmp_transport;
}
extern "C" {
    pub fn netsnmp_transport_free(t: *mut netsnmp_transport);
}
extern "C" {
    pub fn netsnmp_transport_cache_get(
        af: ::std::os::raw::c_int,
        type_: ::std::os::raw::c_int,
        local: ::std::os::raw::c_int,
        bind_addr: *const netsnmp_sockaddr_storage,
    ) -> *mut netsnmp_transport;
}
extern "C" {
    pub fn netsnmp_transport_cache_save(
        af: ::std::os::raw::c_int,
        type_: ::std::os::raw::c_int,
        local: ::std::os::raw::c_int,
        addr: *const netsnmp_sockaddr_storage,
        t: *mut netsnmp_transport,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn netsnmp_transport_cache_remove(t: *mut netsnmp_transport) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn netsnmp_tdomain_support(
        in_oid: *const oid,
        in_len: size_t,
        out_oid: *mut *const oid,
        out_len: *mut size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn netsnmp_tdomain_register(domain: *mut netsnmp_tdomain) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn netsnmp_tdomain_unregister(domain: *mut netsnmp_tdomain) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn netsnmp_clear_tdomain_list();
}
extern "C" {
    pub fn netsnmp_tdomain_init();
}
extern "C" {
    pub fn netsnmp_tdomain_transport(
        str_: *const ::std::os::raw::c_char,
        local: ::std::os::raw::c_int,
        default_domain: *const ::std::os::raw::c_char,
    ) -> *mut netsnmp_transport;
}
extern "C" {
    pub fn netsnmp_tdomain_transport_full(
        application: *const ::std::os::raw::c_char,
        str_: *const ::std::os::raw::c_char,
        local: ::std::os::raw::c_int,
        default_domain: *const ::std::os::raw::c_char,
        default_target: *const ::std::os::raw::c_char,
    ) -> *mut netsnmp_transport;
}
extern "C" {
    pub fn netsnmp_tdomain_transport_oid(
        dom: *const oid,
        dom_len: size_t,
        o: *const u_char,
        o_len: size_t,
        local: ::std::os::raw::c_int,
    ) -> *mut netsnmp_transport;
}
extern "C" {
    pub fn netsnmp_tdomain_transport_tspec(
        tspec: *mut netsnmp_tdomain_spec,
    ) -> *mut netsnmp_transport;
}
extern "C" {
    pub fn netsnmp_transport_open_client(
        application: *const ::std::os::raw::c_char,
        str_: *const ::std::os::raw::c_char,
    ) -> *mut netsnmp_transport;
}
extern "C" {
    pub fn netsnmp_transport_open_server(
        application: *const ::std::os::raw::c_char,
        str_: *const ::std::os::raw::c_char,
    ) -> *mut netsnmp_transport;
}
extern "C" {
    pub fn netsnmp_transport_open(
        application: *const ::std::os::raw::c_char,
        str_: *const ::std::os::raw::c_char,
        local: ::std::os::raw::c_int,
    ) -> *mut netsnmp_transport;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct netsnmp_transport_config_s {
    pub key: *mut ::std::os::raw::c_char,
    pub value: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_netsnmp_transport_config_s() {
    assert_eq!(
        ::std::mem::size_of::<netsnmp_transport_config_s>(),
        16usize,
        concat!("Size of: ", stringify!(netsnmp_transport_config_s))
    );
    assert_eq!(
        ::std::mem::align_of::<netsnmp_transport_config_s>(),
        8usize,
        concat!("Alignment of ", stringify!(netsnmp_transport_config_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_transport_config_s>())).key as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_transport_config_s),
            "::",
            stringify!(key)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<netsnmp_transport_config_s>())).value as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_transport_config_s),
            "::",
            stringify!(value)
        )
    );
}
impl Default for netsnmp_transport_config_s {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type netsnmp_transport_config = netsnmp_transport_config_s;
extern "C" {
    pub fn netsnmp_transport_config_compare(
        left: *mut netsnmp_transport_config,
        right: *mut netsnmp_transport_config,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn netsnmp_transport_create_config(
        key: *mut ::std::os::raw::c_char,
        value: *mut ::std::os::raw::c_char,
    ) -> *mut netsnmp_transport_config;
}
extern "C" {
    pub fn netsnmp_transport_parse_filterType(
        word: *const ::std::os::raw::c_char,
        cptr: *mut ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn netsnmp_transport_filter_add(
        addrtxt: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn netsnmp_transport_filter_remove(
        addrtxt: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn netsnmp_transport_filter_check(
        addrtxt: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn netsnmp_transport_filter_cleanup();
}
extern "C" {
    pub fn netsnmp_register_default_domain(
        application: *const ::std::os::raw::c_char,
        domain: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn netsnmp_lookup_default_domain(
        application: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn netsnmp_lookup_default_domains(
        application: *const ::std::os::raw::c_char,
    ) -> *const *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn netsnmp_clear_default_domain();
}
extern "C" {
    pub fn netsnmp_register_default_target(
        application: *const ::std::os::raw::c_char,
        domain: *const ::std::os::raw::c_char,
        target: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn netsnmp_lookup_default_target(
        application: *const ::std::os::raw::c_char,
        domain: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn netsnmp_clear_default_target();
}
extern "C" {
    pub fn netsnmp_register_service_handlers();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct netsnmp_callback_pass_s {
    pub return_transport_num: ::std::os::raw::c_int,
    pub pdu: *mut netsnmp_pdu,
    pub next: *mut netsnmp_callback_pass_s,
}
#[test]
fn bindgen_test_layout_netsnmp_callback_pass_s() {
    assert_eq!(
        ::std::mem::size_of::<netsnmp_callback_pass_s>(),
        24usize,
        concat!("Size of: ", stringify!(netsnmp_callback_pass_s))
    );
    assert_eq!(
        ::std::mem::align_of::<netsnmp_callback_pass_s>(),
        8usize,
        concat!("Alignment of ", stringify!(netsnmp_callback_pass_s))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<netsnmp_callback_pass_s>())).return_transport_num as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_callback_pass_s),
            "::",
            stringify!(return_transport_num)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_callback_pass_s>())).pdu as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_callback_pass_s),
            "::",
            stringify!(pdu)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_callback_pass_s>())).next as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_callback_pass_s),
            "::",
            stringify!(next)
        )
    );
}
impl Default for netsnmp_callback_pass_s {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type netsnmp_callback_pass = netsnmp_callback_pass_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct netsnmp_callback_info_s {
    pub linkedto: ::std::os::raw::c_int,
    pub parent_data: *mut ::std::os::raw::c_void,
    pub data: *mut netsnmp_callback_pass,
    pub callback_num: ::std::os::raw::c_int,
    pub pipefds: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout_netsnmp_callback_info_s() {
    assert_eq!(
        ::std::mem::size_of::<netsnmp_callback_info_s>(),
        40usize,
        concat!("Size of: ", stringify!(netsnmp_callback_info_s))
    );
    assert_eq!(
        ::std::mem::align_of::<netsnmp_callback_info_s>(),
        8usize,
        concat!("Alignment of ", stringify!(netsnmp_callback_info_s))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<netsnmp_callback_info_s>())).linkedto as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_callback_info_s),
            "::",
            stringify!(linkedto)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<netsnmp_callback_info_s>())).parent_data as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_callback_info_s),
            "::",
            stringify!(parent_data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_callback_info_s>())).data as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_callback_info_s),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<netsnmp_callback_info_s>())).callback_num as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_callback_info_s),
            "::",
            stringify!(callback_num)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<netsnmp_callback_info_s>())).pipefds as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(netsnmp_callback_info_s),
            "::",
            stringify!(pipefds)
        )
    );
}
impl Default for netsnmp_callback_info_s {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
pub type netsnmp_callback_info = netsnmp_callback_info_s;
extern "C" {
    pub fn netsnmp_callback_transport(arg1: ::std::os::raw::c_int) -> *mut netsnmp_transport;
}
extern "C" {
    pub fn netsnmp_callback_hook_parse(
        sp: *mut netsnmp_session,
        pdu: *mut netsnmp_pdu,
        packetptr: *mut u_char,
        len: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn netsnmp_callback_hook_build(
        sp: *mut netsnmp_session,
        pdu: *mut netsnmp_pdu,
        ptk: *mut u_char,
        len: *mut size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn netsnmp_callback_check_packet(pkt: *mut u_char, len: size_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn netsnmp_callback_create_pdu(
        transport: *mut netsnmp_transport,
        opaque: *mut ::std::os::raw::c_void,
        olength: size_t,
    ) -> *mut netsnmp_pdu;
}
extern "C" {
    pub fn netsnmp_callback_open(
        attach_to: ::std::os::raw::c_int,
        return_func: ::std::option::Option<
            unsafe extern "C" fn(
                op: ::std::os::raw::c_int,
                session: *mut netsnmp_session,
                reqid: ::std::os::raw::c_int,
                pdu: *mut netsnmp_pdu,
                magic: *mut ::std::os::raw::c_void,
            ) -> ::std::os::raw::c_int,
        >,
        fpre_parse: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut netsnmp_session,
                arg2: *mut netsnmp_transport_s,
                arg3: *mut ::std::os::raw::c_void,
                arg4: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_int,
        >,
        fpost_parse: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut netsnmp_session,
                arg2: *mut netsnmp_pdu,
                arg3: ::std::os::raw::c_int,
            ) -> ::std::os::raw::c_int,
        >,
    ) -> *mut netsnmp_session;
}
extern "C" {
    pub fn netsnmp_clear_callback_list();
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sockaddr_un {
    pub sun_family: sa_family_t,
    pub sun_path: [::std::os::raw::c_char; 108usize],
}
#[test]
fn bindgen_test_layout_sockaddr_un() {
    assert_eq!(
        ::std::mem::size_of::<sockaddr_un>(),
        110usize,
        concat!("Size of: ", stringify!(sockaddr_un))
    );
    assert_eq!(
        ::std::mem::align_of::<sockaddr_un>(),
        2usize,
        concat!("Alignment of ", stringify!(sockaddr_un))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr_un>())).sun_family as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_un),
            "::",
            stringify!(sun_family)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<sockaddr_un>())).sun_path as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_un),
            "::",
            stringify!(sun_path)
        )
    );
}
impl Default for sockaddr_un {
    fn default() -> Self {
        unsafe { ::std::mem::zeroed() }
    }
}
extern "C" {
    pub fn memcpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memmove(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memccpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memset(
        __s: *mut ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memcmp(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn memchr(
        __s: *const ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn rawmemchr(
        __s: *const ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memrchr(
        __s: *const ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: size_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn strcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcat(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strncat(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcoll(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strxfrm(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strcoll_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __l: locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strxfrm_l(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: size_t,
        __l: locale_t,
    ) -> size_t;
}
extern "C" {
    pub fn strdup(__s: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strndup(
        __string: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strchr(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strrchr(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strchrnul(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcspn(
        __s: *const ::std::os::raw::c_char,
        __reject: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strspn(
        __s: *const ::std::os::raw::c_char,
        __accept: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strpbrk(
        __s: *const ::std::os::raw::c_char,
        __accept: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strstr(
        __haystack: *const ::std::os::raw::c_char,
        __needle: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strtok(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __strtok_r(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
        __save_ptr: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strtok_r(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
        __save_ptr: *mut *mut ::std::os::raw::c_char,
